@extends('mobile.main_layout.main')
@section('app_header')
<div class="appHeader bg-danger text-light">
    <div class="left">
        <ion-icon name="arrow-back-outline" onclick="window.history.back();"></ion-icon>
    </div>
    <div class="pageTitle">
        ศูนย์ความช่วยเหลือ
    </div>
</div>
@endsection
@section('content')

    <div class="col-12 m-0 p-2">
        <h3 class="text-center">ข้อตกลงและเงื่อนไข </h3>
<u>1. บทนำ</u>
<br>
1.1 ขอต้อนรับสู่แพลตฟอร์ม (“ไซต์”) โปรดอ่านเงื่อนไขการให้บริการต่อไปนี้อย่างละเอียดก่อนใช้ไซต์นี้หรือเปิดบัญชี Moldii App (“บัญชี”) เพื่อที่คุณจะได้ทราบถึงสิทธิและข้อผูกพันตามกฎหมายของคุณอันเกี่ยวเนื่องกับ บริษัท เพลินพอดี จำกัด และบริษัทย่อยและบริษัทในเครือ (เรียกแยกและเรียกรวมกันว่า “Moldii App”, “เรา”, “พวกเรา” หรือ “ของเรา”) “บริการ” ที่เราจัดไว้ให้หรือทำให้ใช้งานได้รวมถึง (ก) ไซต์ (ข) บริการที่จัดไว้ให้โดยไซต์และโดยซอฟต์แวร์ไคลเอ็นต์ Moldii App ที่ทำให้ใช้งานได้ผ่านทางไซต์ และ (ค) ข้อมูลข่าวสารทั้งหมด หน้าที่เชื่อมโยง คุณสมบัติ ข้อมูล ข้อความสั้นๆ รูปภาพ ภาพถ่าย กราฟิก เพลง เสียง วิดีโอ (รวมถึงการทำ live stream) ข้อความ แท็ก เนื้อหา โปรแกรม ซอฟต์แวร์ บริการแอปพลิเคชัน (รวมถึงโดยไม่จำกัดเพียงบริการแอปพลิเคชันบนมือถือใดๆ) หรือวัสดุอื่นๆ ที่ทำให้ใช้งานได้ผ่านทางไซต์หรือบริการที่เกี่ยวข้องกับไซต์ ("เนื้อหา") คุณสมบัติใหม่ใดๆ ที่เพิ่มไปยังหรือเสริมให้กับบริการจะอยู่ภายใต้เงื่อนไขการให้บริการนี้ด้วยเช่นกัน เงื่อนไขการให้บริการนี้จะควบคุมการใช้บริการของคุณซึ่งจัดไว้ให้โดย Moldii App
<br>
1.2 บริการที่รวมบริการแพลตฟอร์มออนไลน์ซึ่งจัดหาสถานที่และโอกาส เพื่อการขายสินค้าระหว่างผู้ซื้อ (“ผู้ซื้อ”) และผู้ขาย (“ผู้ขาย”) (เรียกรวมว่า “คุณ” “ผู้ใช้” หรือ “คู่ให้สิทธิให้”) สัญญาขายที่แท้จริงเป็นสัญญาระหว่างผู้ซื้อและผู้ขายโดยตรง และ Moldii App ไม่ได้เป็นคู่สัญญาของสัญญาฉบับนั้นหรือสัญญาอื่นใดระหว่างผู้ซื้อและผู้ขาย และจะไม่ยอมรับข้อผูกพันใดๆ ที่เกี่ยวเนื่องกับสัญญาดังกล่าว คู่สัญญาของธุรกรรมดังกล่าวจะรับผิดชอบต่อสัญญาขายระหว่างคู่สัญญาทั้งหมด บัญชีรายชื่อสินค้า การรับประกันการซื้อและสิ่งอื่นที่คล้ายกัน Moldii App ไม่มีส่วนเกี่ยวข้องในธุรกรรมระหว่างผู้ใช้ Moldii App ไม่ทำการคัดกรองล่วงหน้าต่อผู้ใช้ หรือเนื้อหาหรือข้อมูลที่จัดไว้ให้โดยผู้ใช้ Moldii App ไม่สามารถรับประกันว่าผู้ใช้จะทำธุรกรรมเสร็จสิ้นจริงๆ
<br>
1.3 ก่อนที่จะเป็นสมาชิกของไซต์ คุณจะต้องอ่านและยอมรับข้อกำหนด นโยบาย และเงื่อนไขทั้งหมดใน และที่เชื่อมโยงกับ เงื่อนไขการให้บริการนี้และคุณจะต้องยินยอมรับการดำเนินการข้อมูลส่วนบุคคลของคุณดังที่อธิบายไว้ในนโยบายความเป็นส่วนตัวซึ่งมีลิงก์ไว้ในที่นี้
<br>
1.4 Moldii App สงวนสิทธิ์ในการเปลี่ยนแปลง ดัดแปลง ระงับ หรือยกเลิกไซต์นี้หรือบริการทั้งหมดหรือบางส่วนได้ตลอดเวลา Moldii App อาจออกบริการบางอย่างหรือคุณสมบัติของบริการในรุ่นเบต้า ซึ่งอาจไม่ทำงานอย่างถูกต้อง หรือในลักษณะเดียวกันกับที่รุ่นสุดท้ายอาจทำงาน และเราจะไม่รับผิดในสถานการณ์ดังกล่าว Moldii App ยังอาจกำหนดขอบเขตสำหรับคุณสมบัติบางอย่าง หรือจำกัดการเข้าถึงบางส่วนหรือทั้งหมดของไซต์หรือบริการโดยใช้ดุลยพินิจของตัวเองแต่เพียงผู้เดียว และโดยไม่ต้องแจ้งหรือรับผิด
<br>
1.5 Moldii App สงวนสิทธิ์ในการปฏิเสธที่จะให้คุณเข้าถึงไซต์หรือบริการ หรือปฏิเสธที่จะอนุญาตให้คุณเปิดบัญชีไม่ว่าด้วยเหตุผลใดก็ตาม

โดยการใช้บริการหรือเปิดบัญชี Moldii App คุณได้ให้การยอมรับและความยินยอมที่เพิกถอนไม่ได้ต่อข้อตกลงนี้ รวมถึงข้อกำหนด เงื่อนไขและนโยบายเพิ่มเติมที่อ้างถึงในที่นี่และ/หรือมีลิงก์ไว้ในที่นี้

หากคุณไม่เห็นด้วยกับข้อตกลงนี้ โปรดงดใช้บริการหรือเข้าถึงไซต์ของเรา หากคุณอายุต่ำกว่า 18 ปีหรือยังไม่บรรลุนิติภาวะที่จะให้คำยินยอมต่อข้อกำหนดนี้ตามกฎหมายที่เกี่ยวข้องในประเทศของคุณ (“นิติภาวะ”) คุณจะต้องขออนุญาตจากพ่อแม่หรือผู้ปกครองตามกฎหมายเพื่อเปิดบัญชี และพ่อแม่หรือผู้ปกครองตามกฎหมายดังกล่าวต้องเห็นด้วยกับข้อกำหนดของข้อตกลงนี้ หากคุณไม่ทราบว่าคุณบรรลุนิติภาวะแล้วหรือยัง หรือไม่เข้าใจความในข้อนี้ โปรดอย่าสร้างบัญชีจนกว่าจะได้ขอความช่วยเหลือจากพ่อแม่หรือผู้ปกครองตามกฎหมายแล้ว หากคุณคือพ่อแม่หรือผู้ปกครองตามกฎหมายของผู้เยาว์ที่กำลังสร้างบัญชี คุณจะต้องยอมรับข้อกำหนดของข้อตกลงนี้แทนผู้เยาว์และคุณจะต้องรับผิดชอบต่อการใช้งานบัญชีหรือบริการของบริษัททั้งหมดจากการใช้บัญชีดังกล่าว ไม่ว่าบัญชีดังกล่าวจะเปิดอยู่แล้วในขณะนี้หรือสร้างในภายหลังก็ตาม











<br>
<u>2. ความเป็นส่วนตัว</u>
<br>
2.1 ความเป็นส่วนตัวของคุณมีความสำคัญมากสำหรับ Moldii App เพื่อให้คุ้มครองสิทธิของคุณได้ดีขึ้น เราจึงได้จัดทำนโยบายความเป็นส่วนตัวของ Moldii App เพื่ออธิบายแนวทางปฏิบัติด้านความเป็นส่วนตัวในรายละเอียด โปรดอ่านนโยบายความเป็นส่วนตัวนี้เพื่อให้เข้าใจว่า Moldii App เก็บรวบรวมและใช้ข้อมูลที่เกี่ยวกับบัญชีของคุณและ/หรือการใช้งานบริการของคุณอย่างไร (“ข้อมูลของผู้ใช้”) โดยการใช้บริการหรือให้ข้อมูลทางไซต์ คุณ:
<br>
(ก) ยินยอมให้ Moldii App เก็บรวบรวม ใช้งาน เปิดเผย และ/หรือดำเนินการกับเนื้อหา ข้อมูลส่วนบุคคลของคุณและข้อมูลของผู้ใช้ตามที่อธิบายไว้ในนโยบายความเป็นส่วนตัว
<br>
(ข) ตกลงและยอมรับว่าสิทธิการเป็นเจ้าของในข้อมูลของผู้ใช้เป็นของ Moldii App และของคุณร่วมกัน
<br>
(ค) จะไม่เปิดเผยข้อมูลของผู้ใช้ต่อบุคคลภายนอก ไม่ว่าทั้งหมดหรือบางส่วน หรือยินยอมให้บุคคลภายนอกสามารถเข้าถึงหรือใช้ข้อมูลของผู้ใช้ของท่านโดยไม่ได้รับความยินยอมจาก Moldii App เป็นลายลักษณ์อักษรก่อน
<br>
2.2 ผู้ใช้ที่ครอบครองข้อมูลส่วนบุคคลของผู้ใช้คนอื่นผ่านการใช้บริการ (“ฝ่ายผู้รับ”) ตกลงว่าจะ (1) ปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลที่บังคับใช้ทั้งหมดอันเกี่ยวกับข้อมูลดังกล่าว (2) อนุญาตให้ผู้ใช้ ซึ่งฝ่ายผู้รับได้เก็บรวบรวมข้อมูลส่วนบุคคลไว้ (“ฝ่ายผู้เปิดเผย”) ลบข้อมูลของตนที่เก็บรวบรวมไว้ออกจากฐานข้อมูลของฝ่ายผู้รับ และ (3) อนุญาตให้ฝ่ายผู้เปิดเผยตรวจสอบว่าฝ่ายผู้รับมีการเก็บรวบรวมข้อมูลใดบ้างเกี่ยวกับตน ในแต่ละกรณีของข้อ (2) และข้อ (3) ข้างต้น ตามและเมื่อกฎหมายที่บังคับใช้กำหนดไว้







<br>

<u>3. สิทธิ์การใช้งานแบบจำกัด</u>
<br>
3.1 Moldii App มอบสิทธิ์การใช้งานแบบจำกัดและเพิกถอนได้ในการเข้าถึงและใช้บริการตามข้อกำหนด และเงื่อนไขของเงื่อนไขการให้บริการนี้ เนื้อหา เครื่องหมายการค้า เครื่องหมายบริการ ชื่อตราสินค้า โลโก้ และทรัพย์สินทางปัญญาอื่นๆ ที่มีกรรมสิทธิ์ทั้งหมด (“ทรัพย์สินทางปัญญา”) ที่แสดงในไซต์ เป็นทรัพย์สินของ Moldii App และหากเหมาะสม เป็นทรัพย์สินของบุคคลภายนอกที่ถือกรรมสิทธิ์ตามที่ระบุไว้ในไซต์ ไม่มีการมอบสิทธิหรือสิทธิ์การใช้งานทั้งโดยตรงหรือโดยอ้อมแก่บุคคลใดที่เข้าถึงไซต์เพื่อใช้งานหรือลอกเลียนแบบทรัพย์สินทางปัญญาใด และไม่มีบุคคลใดที่เข้าถึงไซต์จะสามารถอ้างสิทธิ กรรมสิทธิ์ หรือผลประโยชน์ในไซต์นี้ได้ โดยการใช้หรือเข้าถึงบริการ คุณตกลงที่จะปฏิบัติตามกฎหมายลิขสิทธิ์ เครื่องหมายการค้า เครื่องหมายบริการ และกฎหมายที่บังคับใช้อื่นๆ ทั้งหมด ที่คุ้มครองบริการ ไซต์ และเนื้อหาในไซต์ คุณตกลงที่จะไม่คัดลอก แจกจ่าย เผยแพร่ต่อ ส่งต่อ แสดงแก่สาธารณะ ดำเนินการต่อสาธารณะ ดัดแปลง ปรับเปลี่ยน ให้เช่า ขาย หรือสร้างงานอนุพันธ์จากส่วนหนึ่งส่วนใดของบริการ ไซต์ หรือเนื้อหาในไซต์ คุณยังจะต้องไม่สะท้อนหรือตีกรอบส่วนหนึ่งส่วนใดหรือทั้งหมดของเนื้อหาในไซต์นี้บนเซิร์ฟเวอร์อื่นใด หรือเป็นส่วนหนึ่งของเว็บไซต์อื่น โดยไม่ได้รับคำยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากเรา นอกจากนี้ คุณตกลงว่าจะไม่ใช้โรบอต สไปเดอร์ หรืออุปกรณ์อัตโนมัติอื่นใด หรือกระบวนการที่ทำด้วยมือเพื่อเฝ้าติดตามหรือคัดลอกเนื้อหาของเรา โดยไม่ได้รับคำยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากเรา (คำยินยอมดังกล่าวจะถือว่ามอบให้สำหรับเทคโนโลยีเครื่องมือค้นหามาตรฐานที่ใช้โดยเว็บไซต์ค้นหาทางอินเทอร์เน็ตเพื่อนำผู้ใช้อินเทอร์เน็ตมายังเว็บไซต์นี้)
<br>
3.2 คุณสามารถเชื่อมโยงไปยังไซต์จากเว็บไซต์ของคุณ โดยมีข้อแม้ว่าเว็บไซต์ของคุณไม่ได้แสดงนัยของการรับรองโดยหรือเชื่อมโยงกับ Moldii App คุณรับทราบว่า Moldii App อาจยกเลิกการให้บริการไม่ว่าทั้งหมดหรือบางส่วนได้ตลอดเวลา ตามดุลยพินิจแต่เพียงผู้เดียวของตน โดยไม่ต้องแจ้งให้ทราบ








<br>

<u>4. ซอฟต์แวร์</u>
<br>
ซอฟต์แวร์ที่เราจัดไว้ให้คุณเป็นส่วนหนึ่งของบริการนี้ อยู่ภายใต้ข้อกำหนดของเงื่อนไขการให้บริการนี้ Moldii App สงวนสิทธิ์ทั้งหมดต่อซอฟต์แวร์ที่ไม่ได้อนุญาตไว้อย่างชัดแจ้งโดย Moldii App  ในที่นี้ สคริปต์หรือรหัสของบุคคลภายนอก ที่เชื่อมโยงไปยังหรืออ้างถึงจากบริการ บุคคลภายนอกที่เป็นเจ้าของสคริปต์หรือรหัสดังกล่าวเป็นผู้มอบสิทธิ์การใช้งานให้แก่คุณ ไม่ใช่มอบให้โดย Moldii App


<br>
<u>5. บัญชีและความปลอดภัย</u>
<br>
5.1 การทำงานบางอย่างของบริการของเราต้องมีการลงทะเบียนบัญชีโดยเลือกรหัสประจำตัวผู้ใช้ที่ไม่ซ้ำกัน ("ID ผู้ใช้") และรหัสผ่าน และโดยการให้ข้อมูลส่วนบุคคลบางอย่าง หากคุณเลือก ID ผู้ใช้ ที่ตามดุลยพินิจแต่เพียงผู้เดียวของ Moldii App เห็นว่า สร้างความขุ่นเคืองหรือไม่เหมาะสม Moldii App มีสิทธิที่จะระงับหรือยกเลิกบัญชีของคุณได้ คุณอาจสามารถใช้บัญชีเพื่อเข้าถึงผลิตภัณฑ์ เว็บไซต์ หรือบริการอื่นๆ ซึ่งเราอนุญาตให้เข้าถึงได้ หรือที่เชื่อมโยงกันหรือทำงานร่วมกัน Moldii App ไม่ได้ตรวจสอบ และไม่รับผิดชอบต่อเนื้อหาของบุคคลภายนอก ฟังก์ชั่นการทำงาน ความปลอดภัย บริการ นโยบายความเป็นส่วนตัว หรือการปฏิบัติอื่นๆ ของผลิตภัณฑ์ เว็บไซต์ หรือบริการเหล่านั้น หากคุณกระทำการดังกล่าว เงื่อนไขการให้บริการของผลิตภัณฑ์ เว็บไซต์ หรือบริการเหล่านั้น รวมถึงนโยบายความเป็นส่วนตัวที่เกี่ยวข้อง หากแตกต่างจากเงื่อนไขการให้บริการและ/หรือนโยบายความเป็นส่วนตัวของเรา อาจบังคับใช้กับการใช้ผลิตภัณฑ์ เว็บไซต์ หรือบริการเหล่านั้นของคุณ
<br>
5.2 คุณตกลงที่จะ (ก) เก็บรักษารหัสผ่านไว้เป็นความลับและใช้เฉพาะ ID ผู้ใช้และรหัสผ่านของคุณเมื่อเข้าสู่ระบบ (ข) ตรวจสอบให้แน่ใจว่าคุณออกจากระบบบัญชีเมื่อสิ้นสุดแต่ละเซสชันบนไซต์ (ค) แจ้ง Moldii App ทันทีหากมีการใช้บัญชี ID ผู้ใช้ และ/หรือรหัสผ่านของคุณโดยไม่ได้รับอนุญาต (ง) ตรวจสอบให้แน่ใจว่าข้อมูลบัญชีของคุณถูกต้องและเป็นปัจจุบันอยู่เสมอ คุณต้องรับผิดชอบอย่างเต็มที่ต่อกิจกรรมทั้งหมดที่เกิดขึ้นภายใต้ ID ผู้ใช้และบัญชีของคุณ แม้ว่าคุณจะไม่ได้ทำกิจกรรมหรือทำการใช้งานดังกล่าวก็ตาม Moldii App จะไม่รับผิดต่อความสูญเสียหรือความเสียหายที่เกิดจากการใช้รหัสผ่านของคุณโดยไม่ได้อนุญาต หรือการที่คุณไม่สามารถปฏิบัติตามความในส่วนนี้
<br>
5.3 คุณตกลงว่า Moldii App อาจ ไม่ว่าด้วยเหตุผลใดและตามดุลยพินิจแต่เพียงผู้เดียวของตน และโดยไม่ต้องแจ้งหรือรับผิดต่อคุณหรือบุคคลภายนอกใดๆ ยกเลิกบัญชีและ ID ผู้ใช้ของคุณทันที และลบหรือเพิกถอนเนื้อหาใดก็ตามที่เกี่ยวข้องกับบัญชีหรือ ID ผู้ใช้ของคุณออกจากไซต์ หรือในกรณีที่ร้ายแรงกว่านั้นอาจระงับการขายหรือการคืนเงินใดๆอย่างถาวรและ/หรือใช้มาตราการอื่นใดที่ Moldii App เห็นสมควร มูลเหตุสำหรับการยกเลิกดังกล่าวอาจได้แก่ แต่ไม่จำกัดเพียง (ก) การไม่มีการใช้งานเป็นเวลานานๆ (ข) การละเมิดเจตนารมณ์หรือตัวอักษรของเงื่อนไขการให้บริการนี้ (ค) พฤติกรรมผิดกฎหมาย ฉ้อฉล ล่วงละเมิด ทำให้เสื่อมเสีย คุกคาม หรือขู่เข็ญ (ง) การมีบัญชีผู้ใช้หลายบัญชีเพื่อเหตุอันมิชอบด้วยกฎหมาย (จ) การซื้อสินค้าจากไซต์โดยมีวัตถุประสงค์เพื่อการจำหน่ายต่อ (ฉ) การซื้อสินค้าจากผู้ขายรายเดียวหรือกลุ่มผู้ขายเดียวกันในลักษณะที่ผิดปกติวิสัยหรือในปริมาณที่มากเกินปกติ (ช) การใช้ voucherส่วนลดในทางที่ผิด (รวมถึง แต่ไม่จำกัดซึ่ง การจำหน่ายvoucherส่วนลดให้แก่บุคคลอื่น หรือการจำหน่าย voucherส่วนลด หรือเครดิต(credit)โดยการเพิ่มราคาให้สูงกว่ามูลค่าที่เป็นจริง หรือการใช้voucherส่วนลดในลักษณะที่ผิดปกติวิสัยหรือในปริมาณที่มากเกินปกติบนไซต์ หรือ(ซ) พฤติกรรมที่เป็นอันตรายต่อผู้ใช้คนอื่น บุคคลภายนอก หรือผลประโยชน์ทางธุรกิจของ Moldii App การใช้บัญชีเพื่อจุดประสงค์ที่ผิดกฎหมาย ฉ้อฉล ล่วงละเมิด ทำให้เสื่อมเสีย คุกคาม หรือขู่เข็ญ อาจมีการแจ้งให้หน่วยงานบังคับใช้กฎหมายทราบโดยไม่ต้องแจ้งแก่คุณ หากเกิดข้อพิพาททางกฎหมายหรือการดำเนินคดีเกี่ยวกับบัญชีหรือการใช้บริการของคุณ ไม่ว่าด้วยเหตุผลใดก็ตาม Moldii App อาจยกเลิกบัญชีของคุณทันทีโดยไม่แจ้งให้ทราบ
<br>
5.4 ผู้ใช้สามารถยกเลิกบัญชีของตนได้หากแจ้งให้ Moldii App ทราบเป็นลายลักษณ์อักษร (รวมทั้งทางอีเมลที่ moldiiapp@gmail.com) ว่าประสงค์ที่จะดำเนินการดังกล่าว โดยไม่คำนึงถึงการยกเลิกดังกล่าว ผู้ใช้ยังคงต้องรับผิดชอบและรับผิดต่อธุรกรรมใดก็ตามที่ยังทำไม่เสร็จสิ้น (ไม่ว่าจะเริ่มก่อนหรือหลังการยกเลิกดังกล่าว) การจัดส่งผลิตภัณฑ์ การชำระค่าผลิตภัณฑ์ หรืออย่างอื่นที่คล้ายกัน และผู้ใช้จะต้องติดต่อ Moldii App หลังจากได้ดำเนินการและทำธุรกรรมที่ยังไม่เสร็จสิ้นทั้งหมดให้เสร็จสิ้นในทันทีและอย่างมีประสิทธิภาพตามเงื่อนไขการให้บริการนี้ Moldii App ไม่ต้องรับผิด และจะไม่รับผิดต่อความเสียหายที่เกิดขึ้นอันเนื่องมาจากการดำเนินการตามส่วนนี้ ผู้ใช้จะสละสิทธิ์ในการเรียกร้องใดๆ และทั้งหมดบนพื้นฐานการดำเนินการดังกล่าวโดย Moldii App
<br>
5.5 คุณสามารถใช้บริการและ/หรือเปิดบัญชีได้ต่อเมื่อคุณอาศัยอยู่ในประเทศที่ได้รับอนุญาตจากเรา ซึ่งจะมีการปรับปรุงเป็นครั้งคราว







<br>

<u>6. เงื่อนไขการใช้งาน</u>
<br>
6.1 สิทธิ์การใช้งานไซต์นี้และบริการมีผลจนกว่าจะมีการยกเลิก สิทธิ์การใช้งานนี้จะยกเลิกตามที่ระบุไว้ในเงื่อนไขการให้บริการ หรือเมื่อคุณไม่ปฏิบัติตามข้อกำหนดหรือเงื่อนไขใดๆ ของเงื่อนไขการให้บริการนี้ ในกรณีดังกล่าว ไม่จำเป็นต้องแจ้งแก่ Moldii App เพื่อให้การยกเลิกดังกล่าวมีผล
<br>
6.2 คุณตกลงที่จะไม่:<br>
(ก) อัปโหลด โพสต์ ส่งต่อ หรือแสดงเนื้อหาในลักษณะที่ผิดกฎหมาย เป็นภัย คุกคาม ขู่เข็ญ ล่วงละเมิด ทำให้ตื่นตกใจ ทำให้เป็นทุกข์ หลอกลวง ทำให้เสื่อมเสีย หยาบคาย ลามก หมิ่นประมาท ละเอียดอ่อนทางการเมือง ล่วงล้ำความเป็นส่วนตัวของผู้อื่น น่ารังเกียจ เหยียดเชื้อชาติหรือชาติพันธุ์ 
<br>(ข) ละเมิดกฎหมายซึ่งรวมถึงแต่ไม่จำกัดเฉพาะกฎหมายและข้อบังคับที่เกี่ยวกับข้อจำกัดการส่งออกและการนำเข้า สิทธิของบุคคลภายนอก หรือนโยบายสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัด ของเรา
<br>(ค) อัปโหลด โพสต์ ส่งต่อหรือกระทำเนื้อหาใดๆ ที่ส่วนเกี่ยวข้องกับการใช้ผู้เยาว์ที่ไม่ได้อยู่ภายใต้การดูแลของผู้ปกครอง หรือ ใช้บริการเพื่อทำอันตรายต่อผู้เยาว์ไม่ว่าในทางใดก็ตาม
<br>(ง) ใช้บริการหรืออัปโหลดเนื้อหาเพื่อปลอมแปลงเป็นบุคคลหรือนิติบุคคลอื่น หรือแสดงข้อมูลเท็จเกี่ยวกับความเชื่อมโยงกับบุคคลหรือนิติบุคคลใด
<br>(จ) ปลอมแปลงส่วนหัวหรือปรับเปลี่ยนรหัสประจำตัวเพื่อปิดบังแหล่งกำหนดของเนื้อหาที่ส่งต่อผ่านบริการ
<br>(ฉ) ลบประกาศเกี่ยวกับกรรมสิทธิ์ออกจากไซต์
<br>(ช) เป็นต้นเหตุ อนุญาตหรือมอบอำนาจให้ทำการดัดแปลง สร้างงานอนุพันธ์ หรือแปลบริการโดยไม่ได้รับอนุญาตอย่างชัดแจ้งจาก Moldii App
<br>(ซ) ใช้บริการเพื่อประโยชน์ของบุคคลภายนอกหรือในลักษณะที่ไม่ได้รับอนุญาตตามสิทธิ์การใช้งานที่ให้ไว้ในที่นี้
<br>(ฌ) ใช้บริการหรืออัปโหลดเนื้อหาในลักษณะที่ไม่เหมาะสม เป็นการฉ้อฉล ผิดจรรยาบรรณ ไม่เป็นความจริง ชี้นำไปในทางที่ผิดหรือเป็นการหลอกลวง
<br>(ญ) เปิดใช้หรือมีบัญชีผู้ใช้หลายบัญชีเพื่อกระทำการใดๆ ที่เป็นการละเมิดข้อกำหนดหรือวัตถุประสงค์ของข้อกำหนดเงื่อนไขการให้บริการนี้
<br>(ฎ) เข้าถึงแพลตฟอร์มของ Moldii App เปิดบัญชีผู้ใช้หรือเข้าถึงบัญชีผู้ใช้ของคุณโดยใช้ ฮาร์ดแวร์ ชุดคำสั่ง หรือโปรแกรมที่ไม่เป็นทางการ ซึ่งไม่จำกัดเฉพาะ โปรแกรมเลียนแบบ (emulator) โปรแกรมจำลอง (simulator) บอท (bot) หรือซอฟแวร์หรือฮาร์ดแวร์อื่นใด
<br>(ฏ) ปรับเปลี่ยนราคาของสินค้าหรือแทรกแซงบัญชีรายชื่อสินค้าของผู้ใช้รายอื่น
<br>(ฐ) ดำเนินการใดๆ ที่อาจบ่อนทำลายระบบให้ข้อคิดเห็นหรือระบบการให้คะแนน
<br>(ฑ) พยายามแยกส่วนแฟ้ม ทำวิศวกรรมย้อนกลับ ถอดประกอบหรือเจาะระบบบริการ (หรือส่วนหนึ่งส่วนใดของบริการ) หรือเอาชนะหรือทำลายเทคโนโลยีการเข้ารหัสหรือมาตรการความปลอดภัยที่ Moldii App นำมาใช้กับบริการและ/หรือข้อมูลที่ส่งต่อ ดำเนินการ หรือจัดเก็บไว้โดย Moldii App
<br>(ฒ) เก็บเกี่ยวหรือเก็บรวบรวมข้อมูลเกี่ยวกับเจ้าของบัญชีคนอื่น รวมถึง โดยไม่จำกัดเพียงข้อมูลส่วนบุคคลใดๆ
<br>(ณ) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้เนื้อหาที่คุณไม่มีสิทธิ์ทำให้ใช้งานได้ภายใต้กฎหมายหรือภายใต้ความสัมพันธ์ตามสัญญาหรือการมอบอำนาจ (เช่น ข้อมูลภายใน ข้อมูลที่เป็นกรรมสิทธิ์และข้อมูลลับที่ได้ทราบหรือถูกเปิดเผยจากความสัมพันธ์ในการจ้างงานหรือภายใต้ข้อตกลงไม่เปิดเผยข้อมูล) ใช้งานได้
<br>(ด) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้เนื้อหาที่ละเมิดสิทธิบัตร เครื่องหมายการค้า ความลับทางการค้า ลิขสิทธิ์ หรือกรรมสิทธิ์อื่นๆ ของบุคคลอื่น ใช้งานได้
<br>(ต) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้โฆษณาที่ไม่ได้ร้องขอหรือได้รับอนุญาต สื่อประชาสัมพันธ์ “เมลขยะ” “สแปม” “จดหมายลูกโซ่” “ธุรกิจแบบพีระมิด” หรือรูปแบบการเชิญชวนอื่นใดที่ไม่ได้รับอนุญาต ใช้งานได้
<br>(ถ) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้วัสดุอื่นๆ ที่มีไวรัสซอฟต์แวร์ หนอน ม้าโทรจัน หรือรหัสคอมพิวเตอร์ รูทีน ไฟล์หรือโปรแกรมที่ออกแบบมาเพื่อแทรกแซงทั้งโดยตรงและโดยอ้อมต่อ ปรับเปลี่ยน ขัดขวาง ทำลาย หรือจำกัดฟังก์ชั่นการทำงานของซอฟต์แวร์คอมพิวเตอร์หรือฮาร์ดแวร์ใดๆ หรือข้อมูลหรืออุปกรณ์โทรคมนาคม ใช้งานได้
<br>(ท) ทำให้กระบวนการไหลปกติของบทสนทนาหยุดชะงัก ทำให้หน้าจอ “เลื่อน” เร็วกว่าที่ผู้ใช้บริการคนอื่นๆ จะสามารถพิมพ์ได้ หรือกระทำการในลักษณะที่ส่งผลเชิงลบต่อความสามารถของผู้ใช้คนอื่นในการเข้าร่วมการแลกเปลี่ยนตามเวลาจริง
<br>(ธ) แทรกแซง ปรับเปลี่ยน หรือขัดขวางบริการหรือเซิร์ฟเวอร์หรือเครือข่ายที่เชื่อมต่อกับบริการหรือการใช้งานของผู้ใช้คนอื่นและการเพลิดเพลินกับบริการ หรือฝ่าฝืนข้อกำหนด กระบวนการ นโยบาย หรือข้อบังคับของเครือข่ายที่เชื่อมต่อกับไซต์
<br>(น) ดำเนินการหรือเข้าร่วมในการกระทำที่อาจส่งผลเสียหายทั้งทางตรงหรือทางอ้อม ปิดใช้งาน สร้างภาระหนัก หรือทำให้บริการหรือเซิร์ฟเวอร์หรือเครือข่ายที่เชื่อมต่อกับบริการมีข้อบกพร่อง
<br>(บ) ใช้บริการเพื่อเจตนาหรือไม่เจตนาฝ่าฝืนกฎหมาย กฎระเบียบ ประมวลกฎหมาย คำสั่ง แนวทางปฏิบัติ นโยบาย หรือข้อบังคับของท้องถิ่น ของรัฐ ประเทศ หรือระหว่างประเทศที่เกี่ยวข้อง รวมถึง แต่ไม่จำกัดเพียง กฎหมายและข้อกำหนด (ไม่ว่ามีอำนาจทางกฎหมายของไม่) เกี่ยวกับการป้องกันการฟอกเงินหรือการต่อต้านการก่อการร้าย
<br>(ป) ใช้บริการเพื่อฝ่าฝืนหรือหลบเลี่ยง การคว่ำบาตรหรือการห้ามค้าขายที่ดำเนินการหรือบังคับใช้โดยสำนักควบคุมสินทรัพย์ต่างประเทศของกระทรวงการคลังสหรัฐฯ คณะมนตรีความมั่นคงแห่งสหประชาชาติ กระทรวงการคลังสหภาพยุโรปหรือสหราชอาณาจักร
<br>(ผ) ใช้บริการเพื่อฝ่าฝืนความเป็นส่วนตัวของผู้อื่น หรือ “ติดตาม” หรือก่อกวนผู้อื่น
<br>(ฝ) ละเมิดสิทธิต่างๆ ของ Moldii App ซึ่งรวมถึงสิทธิในทรัพย์สินทางปัญญาและการลวงขายในเรื่องนั้นๆ ด้วย
<br>(พ) ใช้บริการเพื่อเก็บรวบรวมหรือจัดเก็บข้อมูลส่วนบุคคลเกี่ยวกับผู้ใช้คนอื่นที่เกี่ยวกับการกระทำและกิจกรรมต้องห้ามที่ระบุไว้ด้านบน 
<br>(ฟ) ลงรายการที่ละเมิดลิขสิทธิ์ เครื่องหมายการค้า หรือสิทธิในทรัพย์สินทางปัญหาของบุคคลภายนอกหรือ ใช้บริการในลักษณะที่จะละเมิดสิทธิ์ในทรัพย์สินทางปัญญาของผู้อื่น และ/หรือ
<br>(ภ) สั่ง หรือ สนับสนุนให้ผู้ใช้ทำธุรกรรมนอกไซต์

            
<br>
6.3 คุณเข้าใจว่าเนื้อหาทั้งหมด ไม่ว่าโพสต์ต่อสาธารณะหรือส่งต่อแบบเป็นส่วนตัว เป็นความรับผิดชอบของผู้ที่เป็นต้นกำเนิดของเนื้อหาดังกล่าวแต่เพียงผู้เดียว นั่นหมายความว่า คุณ (ไม่ใช่ Moldii App) ที่ต้องรับผิดชอบต่อเนื้อหาทั้งหมดที่คุณอัปโหลด โพสต์ อีเมล ส่งต่อ หรือทำให้ใช้งานได้ทางไซต์แต่เพียงผู้เดียว Moldii App ไม่ควบคุมเนื้อหาที่โพสต์บนไซต์ และดังนั้น จึงไม่รับประกันความถูกต้อง ความสมบูรณ์ หรือคุณภาพของเนื้อหาดังกล่าว คุณเข้าใจว่าในการใช้ไซต์ คุณอาจพบเจอกับเนื้อหาที่อาจถือได้ว่าสร้างความขุ่นเคืองใจ ลามกอนาจารหรือน่ารังเกียจ จนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่ว่าในกรณีใดก็ตาม Moldii App จะไม่รับผิดไม่ว่าในทางใดต่อเนื้อหา รวมถึงแต่ไม่จำกัดเพียง ข้อผิดพลาด หรือการละเว้นเนื้อหา หรือการสูญเสียหรือความเสียหายชนิดใดก็ตามที่เกิดขึ้นอันเป็นผลมาจากการใช้ หรือการพึ่งพาเนื้อหาที่โพสต์ อีเมล ส่งต่อ หรือทำให้ใช้งานได้บนไซต์
<br>
6.4 คุณรับทราบว่า Moldii App อาจหรืออาจไม่คัดกรองเนื้อหาล่วงหน้า แต่ Moldii App และผู้ที่ได้รับการแต่งตั้งจาก Moldii App จะมีสิทธิ (แต่ไม่ใช่ข้อผูกพัน) ตามดุลยพินิจแต่เพียงผู้เดียวของตนในการคัดกรองล่วงหน้า ปฏิเสธ ลบหรือย้ายเนื้อหาใดๆ ที่ใช้งานได้บนไซต์ โดยไม่มีความรับผิดใดๆต่อคุณ โดยไม่เป็นการจำกัดสิ่งที่กล่าวไปก่อนหน้า Moldii App และผู้ที่ได้รับการแต่งตั้งจาก Moldii App มีสิทธิที่จะลบเนื้อหา (1) ที่ละเมิดเงื่อนไขการให้บริการ หรือนโยบายสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัดของ Moldii App รวมทั้งข้อกำหนด เงื่อนไข และนโยบายใดๆ ของ Moldii App (2) ถ้าเราได้รับคำร้องเรียนจากผู้ใช้คนอื่น (3) ถ้าเราได้รับแจ้งหรือได้รับการกล่าวหาเกี่ยวกับการละเมิดทรัพย์สินทางปัญญาหรือคำสั่งทางกฎหมายหรือคำร้องให้ลบออก หรือ (4) ถ้าเนื้อหาดังกล่าวไม่เหมาะสมหรือน่ารังเกียจ เรายังอาจปิดกั้นการส่งการสื่อสาร (รวมถึงแต่ไม่จำกัดเพียง การอัปเดตสถานะ การโพสต์ ข้อความ และ/หรือการสนทนา) ไปยังหรือจากบริการ อันเป็นส่วนหนึ่งของความพยายามของเราที่จะปกป้องบริการหรือผู้ใช้ของเรา หรือบังคับใช้บทบัญญัติของข้อกำหนดและเงื่อนไขเหล่านี้ คุณตกลงว่าคุณจะต้องประเมิน และแบกรับความเสี่ยงทั้งหมดที่เกี่ยวกับการใช้เนื้อหา รวมถึงแต่ไม่จำกัดเพียง การพึ่งพาความถูกต้อง ความครบถ้วน หรือประโยชน์ของเนื้อหาดังกล่าว เกี่ยวกับเรื่องนี้ คุณรับทราบว่าคุณไม่ได้ และจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่สามารถพึ่งพาเนื้อหาที่ Moldii App สร้างขึ้น หรือส่งมายัง Moldii App รวมถึงแต่ไม่จำกัดเพียง ข้อมูลในกระดานสนทนาของ Moldii App และในส่วนอื่นๆ ทั้งหมดของไซต์
<br>
6.5 คุณรับทราบ ยินยอม และตกลงว่า Moldii App อาจเข้าถึง รักษา และเปิดเผยข้อมูลบัญชีของคุณและเนื้อหาของคุณต่อหน่วยงานทางกฎหมายหรือผู้มีอำนาจภายในรัฐ เจ้าของสิทธิที่เกี่ยวข้องหรือบุคคลที่สามอื่นๆ หากกฎหมายกำหนดไว้เช่นนั้น หรือตามคำสั่งศาลหรือโดยหน่วยงานรัฐหรือหน่วยงานทางกฎหมายที่มีเขตอำนาจเหนือ Moldii App หรือโดยการเชื่อโดยสุจริตว่าการเข้าถึงเพื่อรักษาหรือเปิดเผยนั้นมีความจำเป็นตามสมควรเพื่อ: (ก) ปฏิบัติตามขั้นตอนทางกฎหมาย (ข) บังคับใช้เงื่อนไขการให้บริการนี้หรือ นโยบายสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัดของ Moldii App รวมทั้งข้อกำหนด เงื่อนไข และนโยบายใดๆ ของ Moldii App (ค) ตอบสนองต่อข้อเรียกร้องที่ว่าเนื้อหาใดละเมิดสิทธิของบุคคลภายนอกรวมถึงสิทธิในทรัพย์สินทางปัญญา (ง) ตอบสนองต่อคำขอการบริการลูกค้าของคุณ หรือ (จ) ปกป้องสิทธิ ทรัพย์สินหรือความปลอดภัยส่วนบุคคลของ Moldii App ผู้ใช้และ/หรือประชาชนทั่วไป







<br>

<u>7. การละเมิดเงื่อนไขการให้บริการของเรา</u>
<br>
<br>7.1 การละเมิดเงื่อนไขการให้บริการนี้ รวมถึงข้อกำหนด เงื่อนไข และนโยบายใดๆ ของ Moldii App อาจส่งผลให้มีการดำเนินการหลายประการ รวมถึงแต่ไม่จำกัดเพียง สิ่งใดสิ่งหนึ่งหรือทั้งหมดต่อไปนี้
<br>o บัญชีรายชื่อถูกลบ
<br>o ถูกกำหนดขีดจำกัดสำหรับสิทธิพิเศษของบัญชี
<br>o บัญชีถูกระงับและยกเลิกในเวลาต่อมา
<br>o ถูกดำเนินคดีอาญา
<br>o ถูกดำเนินคดีทางแพ่ง รวมถึงแต่ไม่จำกัดเพียงการเรียกร้องค่าเสียหายและ/หรือวิธีการชั่วคราว ก่อนพิพากษาหรือคำสั่งห้ามของศาล
<br>
7.2 หากคุณเชื่อว่าผู้ใช้บนไซต์ของเราละเมิดเงื่อนไขการให้บริการนี้ โปรดติดต่อ moldiiapp@gmail.com














<br>
<u>8. การรายงานการละเมิดสิทธิ์ในทรัพย์สินทางปัญญา</u>
<br>
8.1 ตามที่ระบุไว้ข้างต้น Moldii App ไม่อนุญาตให้มีการลงสินค้าที่ละเมิดสิทธิในทรัพย์สินทางปัญญาของแบรนด์หรือเจ้าของสิทธิในทรัพย์สินทางปัญญาอื่นๆ (“เจ้าของIPR”)
<br>
8.2 ยกเว้นในกรณีที่ระบุไว้ชัดแจ้งเป็นอย่างอื่น ผู้ใช้เป็นปัจเจกบุคคลหรือธุรกิจที่เป็นอิสระและไม่เกี่ยวข้องกับ Moldii App ไม่ว่าในทางใด Moldii App มิใช่ตัวแทนหรือผู้แทนของผู้ใช้และมิได้ครอบครองและ/หรือเป็นเจ้าของสินค้าใดๆ ที่ลงรายการไว้บนไซต์
<br>
8.3 หากคุณเป็นเจ้าของ IPR หรือตัวแทนที่ได้รับอนุญาตอย่างถูกต้องจากเจ้าของ IPR (“ตัวแทน IPR”) และคุณเชื่อว่าสิทธิของคุณหรือสิทธิตัวการของคุณได้ถูกละเมิด โปรดแจ้งให้เราทราบ และส่งเอกสารให้แก่เราเพื่อสนับสนุนการเรียกร้องสิทธิของคุณ โปรดให้เวลาเราประมวลข้อมูลที่ได้จัดส่งมาให้เราและ Moldii App จะตอบข้อร้องเรียนของคุณโดยเร็วที่สุดเท่าที่สามารถดำเนินการได้
<br>
8.4 ข้อเรียกร้องภายใต้ส่วนที่ 8 นี้ต้องจัดส่งให้ตามแบบฟอร์มที่กำหนดโดย Moldii App ซึ่งอาจจะมีการปรับปรุงเป็นครั้งคราว และอย่างน้อยต้องดำเนินการดังต่อไปนี้ด้วย (ก) ลงลายมือชื่อจริงหรือลายเซ็นอิเล็กทรอนิกส์ของเจ้าของ IPR หรือ ตัวแทน IPR (เรียกรวมกันว่า “ผู้ให้ข้อมูล”) (ข) คำอธิบายถึงประเภทและลักษณะของสิทธิในทรัพย์สินทางปัญญาที่ถูกกล่าวหาว่าถูกละเมิดและหลักฐานแห่งสิทธิต่างๆ (ค)คำอธิบายลักษณะของการละเมิดที่ถูกกล่าวหาพร้อมรายละเอียดที่เพียงพอเพื่อให้ Moldii App สามารถประเมินข้อร้องเรียนได้ (ง) URLของรายชื่อที่มีการกล่าวหาว่าละเมิด (จ) ข้อมูลเพียงพอที่จะช่วยให้ Moldii App ติดต่อผู้ให้ข้อมูลได้ เช่น ที่อยู่ทางไปรษณีย์ หมายเลขโทรศัพท์ และที่อยู่อีเมล (ฉ) ถ้อยแถลงจากผู้ให้ข้อมูลที่ว่าข้อร้องเรียนนี้ได้ยื่นเข้ามาด้วยความเชื่อโดยสุจริตและการใช้ทรัพย์สินทางปัญญาที่ระบุโดยผู้ให้ข้อมูล ไม่ได้รับอนุญาตจากเจ้าของ IPR หรือตามที่กฎหมายบัญญัติให้ดำเนินการได้ (ช) ถ้อยแถลงจากผู้ให้ข้อมูลที่ว่าข้อมูลในหนังสือบอกกล่าวนั้นถูกต้อง ทั้งนี้ผู้ให้ข้อมูลจะต้องรับผิดชดใช้ค่าเสียหายที่เราอาจได้รับอันเป็นผลมาจากข้อมูลที่ผู้ให้ข้อมูลได้จัดเตรียมมาให้ นอกจากนี้ ผู้ให้ข้อมูลรับรองว่าตนมีสิทธิอย่างเหมาะสมหรือได้รับอนุญาตให้ดำเนินการในนามของเจ้าของ IPR ในทุกกรณีที่เกี่ยวข้องกับการร้องเรียนดังกล่าว
<br>
8.5 นอกจากกรณีที่มีการละเมิดสิทธิสิทธิในทรัพย์สินทางปัญญาตามที่ระบุข้างต้น Moldii App ไม่มีหน้าที่ในการให้ความช่วยเหลือหรือดำเนินการใดๆ ในการบังคับใช้ข้อตกลงทางการค้าระหว่างผู้ผลิตและผู้ขาย รวมถึงเรื่องสิทธิในการจัดจำหน่ายแต่เพียงผู้เดียว และเรื่องการควบคุมราคา 
<br>
8.6 ผู้ขายแต่ละรายและทุกรายตกลงที่จะไม่ให้ Moldii App และบริษัทในเครือ รับผิดชอบจากข้อเรียกร้องทั้งหมด จากการกระทำจากความเสียหายและการตัดสินในการนำเนื้อหาหรือรายการผลิตภัณฑ์ใด ๆ ออก อันเกิดจากการเรียกร้องเกี่ยวกับการละเมิดทรัพย์สินทางปัญญาใด ๆ























<br>

<u>9. การสั่งซื้อและการชำระเงิน</u>
<br>
9.1 Moldii App อาจจัดให้มีการชำระเงินด้วยวิธีการต่างๆ รวมถึงวิธีการซึ่งระบุไว้ต่อไปนี้ ทั้งนี้ Moldii App สงวนสิทธิแต่เพียงผู้เดียวที่จะแก้ไข ระงับ หรือยกเลิกวิธีการชำระเงินประเภทใด ๆ โดยไม่ต้องแจ้งให้ทราบ
<br>
(1) บัตรเครดิต
การชำระผ่านบัตรเครดิตจะดำเนินการผ่านช่องทางการชำระเงินของบุคคลภายนอก และชนิดของบัตรเครดิตที่ช่องทางการชำระเงินเหล่านี้ยอมรับอาจแตกต่างกันไปตามเขตอำนาจตามกฎหมายที่คุณอยู่
<br>
(2) การชำระเงินสดเมื่อรับสินค้า (Cash on Delivery, COD)
Moldii App ได้จัดให้มีบริการรับชำระเงินสดเมื่อรับสินค้าสำหรับการให้บริการในบางประเทศ ผู้ซื้ออาจชำระเงินสดโดยตรงให้แก่ตัวแทนขนส่งสินค้า ณ เวลาที่ผู้ซื้อรับสินค้าที่สั่งซื้อ
<br>
(3) การโอนเงินผ่านธนาคาร
ผู้ซื้อสามารถชำระเงินผ่านเครื่องเอทีเอ็ม QR พร้อมเพย์ หรือโอนเงินผ่านธนาคารทางอินเทอร์เน็ต (“การโอนเงินผ่านธนาคาร”) ไปยังบัญชี Moldii App ที่เรากำหนดไว้ ผู้ซื้อจะต้องส่งใบเสร็จการรับโอนเงินหรือหมายเลขอ้างอิงการทำรายการชำระเงินให้แก่ Moldii App เพื่อทำการตรวจสอบผ่านฟังก์ชั่น “อัปโหลดใบเสร็จ” ที่อยู่ในแอปของ Moldii App เพื่อเป็นการยืนยันการชำระเงิน หาก Moldii App ไม่ได้รับการยืนยันการชำระเงินภายในสาม (3) วัน คำสั่งซื้อของผู้ซื้อจะถูกยกเลิก
<br>
(4) กระเป๋าเงินอิเล็กทรอนิกส์ (E-Wallet)
คุณจะได้รับบริการนี้จาก Moldii App โดยเราจะให้บริการดังกล่าวร่วมกันกับ บริษัท เพลินพอดี จำกัด (“MoldiiPay”) หรือผู้ให้บริการอื่นใดที่เกี่ยวข้องของ Moldii App ตามเงื่อนไข ข้อกำหนดและนโยบายการใช้บริการที่ MoldiiPay หรือผู้ให้บริการที่เกี่ยวข้องเป็นผู้กำหนด หากคุณได้ลงทะเบียนหรือเปิดใช้บัญชีกระเป๋าเงินอิเล็กทรอนิกส์และใช้บริการของ Moldii App ให้ถือว่าคุณได้ยอมรับเงื่อนไข ข้อกำหนดและนโยบายการใช้บริการที่ MoldiiPay หรือผู้ให้บริการที่เกี่ยวข้องกำหนดไว้แล้ว และคุณยินยอมให้ Moldii App ทำการโอนถ่ายข้อมูลส่วนบุคคลของคุณที่ในความดูแลของ Moldii App ให้แก่ MoldiiPay หรือผู้ให้บริการที่เกี่ยวข้องเพื่อใช้ในการเปิดใช้หรือลงทะเบียนบัญชีกระเป๋าเงินอิเล็กทรอนิกส์ การจัดการ ดำเนินการ บริหาร และให้บริการกระเป๋าเงินอิเล็กทรอนิกส์อื่นใดให้แก่คุณ รวมถึงเพื่อวัตถุประสงค์อื่นใดที่เกี่ยวข้องและที่เกี่ยวเนื่องกับการให้บริการดังกล่าว
<br>
9.2 ผู้ซื้อสามารถเปลี่ยนวิธีการชำระเงินที่ต้องการได้ต่อเมื่อเปลี่ยนก่อนทำการชำระเงินเท่านั้น
<br>
9.3 Moldii App ไม่รับผิดชอบและจะไม่ยอมรับผิดใดๆ ต่อความสูญเสียหรือความเสียหายแก่ผู้ซื้ออันเกิดจากข้อมูลการจัดส่งและ/หรือข้อมูลการชำระเงินที่ผู้ซื้อป้อนไว้ หรือการที่ผู้ซื้อโอนเงินค่าชำระสินค้าที่ซื้อไม่ถูกต้อง เราสงวนสิทธิ์ในการตรวจสอบว่าผู้ซื้อได้รับอนุญาตอย่างเหมาะสมให้ใช้วิธีการชำระเงินบางอย่าง และอาจระงับธุรกรรมไว้จนกว่าจะได้ยืนยันการอนุญาตนั้นแล้ว หรือยกเลิกธุรกรรมที่เกี่ยวข้องกรณีไม่มีการยืนยันดังกล่าว
<br>
9.4 ในกรณีที่ Moldii App สามารถชำระเงินแก่ผู้ใช้ทางการโอนเงินผ่านธนาคารเท่านั้น ผู้ใช้จำเป็นต้องให้ข้อมูลบัญชีเงินฝากของตนแก่ Moldii App เพื่อรับการชำระเงิน กล่าวคือ จากการขายสินค้า หรือการคืนเงินจาก Moldii App
















<br>

<u>10.การจัดส่ง</u>
<br>
10.1 ผู้ขายมีหน้าที่ในการจัดส่งสินค้าตามข้อมูลที่ได้รับจากผู้ซื้อ โดย Moldii App จะแจ้งให้ผู้ขายทราบเมื่อ Moldii App ได้รับเงินค่าซื้อสินค้าของผู้ซื้อจากผู้ซื้อแล้ว เพื่อให้ผู้ขายดำเนินการจัดส่งสินค้า โดยผู้ขายจะต้องใช้ความพยายามอย่างเต็มที่ในการทำให้แน่ใจว่าผู้ซื้อได้รับสินค้าที่ซื้อภายในระยะเวลาของ หรือระยะเวลาตามที่ผู้ขายระบุไว้ (สำหรับการชำระเงินแบบออฟไลน์) ในรายการสินค้าของผู้ขาย และผู้ขายต้องเป็นผู้รับผิดชอบค่าจัดส่งสินค้าต่อผู้ขนส่ง (ซึ่งผู้ขายอาจเรียกเก็บจากผู้ซื้ออีกต่อหนึ่งได้) รวมถึงป็นผู้รับภาระความเสี่ยงภัยทั้งหมดที่เกี่ยวกับการจัดส่งสินค้าที่ซื้อ
<br>
10.2 หากผู้ขายมิได้แจ้งให้ Moldii App ทราบว่าผู้ขายประสงค์ที่จะดำเนินการจัดส่งสินค้าด้วยตนเอง หรือมีกรณีซึ่งจะเป็นไปภายใต้ข้อกำหนด นโยบาย หรือเงื่อนไขที่่ Moldii App กำหนดไว้ ผู้ขายและผู้ซื้อรับทราบและตกลงให้บริษัท ขนส่ง เป็นผู้ให้บริการจัดส่งสินค้าที่มีการขายผ่านไซต์ทั้งหมด ยกเว้นธุรกรรมระหว่างประเทศ โดยผู้ขายและผู้ซื้อต้องผูกพันตาม ข้อกำหนดในการให้บริการของบริษัท ขนส่ง และข้อกำหนด เงื่อนไข และนโยบายอื่นๆ ที่เกี่ยวข้อง

เพื่อมิให้มีข้อสงสัย ผู้ขายเป็นผู้มีหน้าที่ในการชำระเงินค่าจัดส่งให้แก่บริษัทขนส่ง แต่ Moldii App และ/หรือ บริษัทขนส่ง อาจให้บริการเรียกเก็บเงินดังกล่าวจากผู้ซื้อแทนผู้ขาย และอาจหักเงินจำนวนดังกล่าวจากเงินค่าซื้อสินค้าของผู้ซื้อบริษัท ขนส่ง ได้ให้บริการจัดส่งสินค้าตามคำสั่งจัดส่งสินค้าแล้ว
<br>
10.3 Moldii App และ/หรือ บริษัท ขนส่ง ไม่มีความเกี่ยวข้องและไม่จำต้องรับผิดใดๆ ต่อผู้ซื้อ ผู้ขาย และ/หรือ บุคคลอื่นใด สำหรับความผิดหรือความเสียหายหรือสูญหายที่เกิดขึ้นจากหรือเกี่ยวเนื่องกับกรณีที่ผู้ขายเป็นผู้ดำเนินการจัดส่งสินค้าโดยมิได้ใช้บริการของบริษัท ขนส่ง รวมถึงการจัดส่งสินค้าที่ดำเนินการจัดส่งโดยผู้ขายเอง หรือที่ดำเนินการจัดส่งผ่านช่องทางอื่นใดที่ไม่ได้เชื่อมต่อผ่านทางไซต์







<br>
<u>11. การยกเลิก การคืนสินค้าและการคืนเงิน</u>
<br>
11.1 ผู้ซื้อสามารถยกเลิกคำสั่งซื้อได้ก่อนที่จะชำระเงินค่าซื้อสินค้าของผู้ซื้อ ไปยังบัญชี บริษัท เพลินพอดี จำกัด เท่านั้น
<br>
11.2 ผู้ซื้อสามารถยื่นคำร้องขอคืนสินค้าที่ซื้อและคืนเงินค่าซื้อสินค้าของผู้ซื้อก่อนวันหมดเขตระยะเวลาของ บริษัท เพลินพอดี จำกัด ถ้าเหมาะสม โดยเป็นไปตามนโยบายการคืนเงินและคืนสินค้าของ Moldii App โปรดดูรายละเอียดเพิ่มเติมจากนโยบายการคืนเงินและคืนสินค้าของ Moldii App
<br>
11.3 Moldii App สงวนสิทธิ์ในการยกเลิกธุรกรรมบนไซต์และผู้ซื้อตกลงว่าการเยียวยาแก่ผู้ซื้อมีอย่างเดียวคือการได้รับการคืนเงินค่าซื้อสินค้าของผู้ซื้อที่จ่ายไปในบัญชี บริษัท เพลินพอดี จำกัด
<br>
11.4 ในกรณีที่มีการยกเลิก การคืนสินค้าและการคืนเงิน คุณตกลงให้ Moldii App หรือตัวแทนที่ได้รับอนุญาตทำการคืนเงินค่าซื้อสินค้าของผู้ซื้อหรือค่าธรรมเนียมอื่นใด ผ่านทาง MoldiiPay Wallet เท่านั้น
<br>
11.5 ถ้าคุณได้แลก Moldii Coin ในการทำธุรกรรมของคุณและคุณได้รับการคืนเงินสำเร็จตามนโยบายการคืนเงินและคืนสินค้าของ Moldii App เช่นนี้ Moldii App จะคืนเงินที่คุณได้จ่ายไปตามจริงสำหรับสินค้าและคืนเครดิต Moldii Coin ที่แลกคืนแก่บัญชีของคุณแยกต่างหาก









<br>

<u>12. ความรับผิดชอบของผู้ขาย</u>
<br>
12.1 ผู้ขายควรจัดการและตรวจสอบอย่างเหมาะสมว่าข้อมูลที่เกี่ยวข้อง เช่น ราคาและรายละเอียดสินค้า จำนวนสินค้าคงคลัง และข้อกำหนดและเงื่อนไขในการขายได้รับการอัปเดตในบัญชีรายชื่อสินค้าของผู้ขาย และไม่โพสต์ข้อมูลที่ไม่ถูกต้องหรือทำให้เข้าใจผิด
<br>
12.2 ราคาสินค้าที่จะขายกำหนดโดยผู้ขายตามดุลยพินิจของผู้ขายเอง จำนวนเงินทั้งหมดที่จะเรียกเก็บกับผู้ซื้อจะรวมราคาสินค้า ค่าจัดส่ง และค่าใช้จ่ายอื่่นๆ เช่น ภาษีขาย ภาษีมูลค่าเพิ่ม ภาษีศุลกากร เป็นต้น และผู้ขายจะไม่เรียกเก็บเงินดังกล่าวจากผู้ซื้อเพิ่มเติมและแยกต่างหาก

ผู้ขายตกลงว่า Moldii App มีสิทธิ (แต่ไม่มีหน้าที่) ในการจัดกิจกรรมส่งเสริมการขาย เพื่อกระตุ้นการทำธุรกรรมระหว่างผู้ซื้อและผู้ขายและธุรกรรมอื่นๆ บนไซต์ ซึ่งรวมไปถึงแต่ไม่จำกัดเพียงการลด ให้ส่วนลด หรือคืนเงินค่าธรรมเนียม หรือด้วยวิธีการอื่นๆ เป็นครั้งคราว ตามดุลพินิจของ Moldii App  ทั้งนี้ Moldii App อาจเรียกเก็บค่าใช้จ่ายทั้งหมดหรือบางส่วนในการจัดกิจกรรมส่งเสริมการขายหรือค่าธรรมเนียมการเข้าร่วมกิจกรรมส่งเสริมการขายจากผู้ขาย โดย Moldii App จะแจ้งหลักเกณฑ์ เงื่อนไข สำหรับกิจกรรมส่งเสริมการขายนั้นๆ ให้ผู้ขายทราบ โดยหากผู้ขายไม่ประสงค์จะเข้าร่วมกิจกรรมดังกล่าว ผู้ขายมีหน้าที่ต้องแจ้งยกเลิกการเข้าร่วมกิจกรรมส่งเสริมการขายต่อ Moldii App เป็นลายลักษณ์อักษร ภายในระยะเวลาทดลองเข้าร่วมกิจกรรมส่งเสริมการขาย หรือภายในระยะเวลาที่ Moldii App กำหนด (แล้วแต่กรณี) มิฉะนั้น จะถือว่าผู้ขายตกลงยินยอมที่จะปฏิบัติตามหลักเกณฑ์ เงื่อนไข และวิธีการสำหรับกิจกรรมส่งเสริมการขายที่เกี่ยวข้อง รวมไปถึงการชำระค่าใช้จ่ายหรือค่าธรรมเนียมการเข้าร่วมกิจกรรมส่งเสริมการขาย (ถ้ามี)) แล้ว
<br>
12.3 เพื่อจุดประสงค์ในการส่งเสริมการขายสินค้าที่ลงรายการไว้โดยผู้ขาย Moldii App อาจโพสต์รายการดังกล่าว (ตามราคาที่ปรับแล้ว) บนเว็บไซต์ของบุคคลภายนอก (เช่น ไซต์พอร์ทัลและไซต์เปรียบเทียบราคา) รวมถึงเว็บไซต์อื่นๆ (ในประเทศหรือต่างประเทศ) ที่ดำเนินการโดย Moldii App
<br>
12.4 ผู้ขายจะต้องออกใบเสร็จรับเงิน สลิปบัตรเครดิต หรือใบกำกับภาษีให้แก่ผู้ซื้อเมื่อร้องขอ


<br>
12.5 ผู้ขายทราบและตกลงว่าผู้ซื้อจะรับผิดชอบการเสียภาษี ศุลกากร และอากรทั้งหมดสำหรับสินค้าที่ขายและ Moldii App ไม่อาจให้คำแนะนำทางกฎหมายหรือภาษีในเรื่องนี้ได้ เนื่องจากกฎหมายและข้อบังคับด้านภาษีอาจมีการเปลี่ยนแปลงเป็นครั้งคราว ดังนั้น จึงแนะนำว่าหากมีข้อสงสัย ผู้ขายควรขอคำแนะนำจากผู้เชี่ยวชาญ
<br>
12.6 ผู้ขายรับทราบและตกลงว่าหากผู้ขายละเมิดนโยบายใดๆ ของ Moldii App จะส่งผลให้มีการดำเนินการต่างๆ ดังที่ระบุไว้ในข้อ 7.1





















<br>
<u>13. ค่าธรรมเนียม</u><br>
13.1 Moldii App เรียกเก็บค่าธรรมเนียมการให้บริการจากผู้ขายตามประเภทค่าธรรมเนียมการให้บริการ ซึ่งเป็นไปตามข้อกำหนดและเงื่อนไขที่กำหนดไว้ใน นโยบายค่าธรรมเนียม ภายใต้นโยบายแอพ
<br>


(1) ค่าธรรมเนียมการขาย
Moldii App เรียกเก็บค่าธรรมเนียมการทำธุรกรรมการขายจากผู้ขายเมื่อผู้ซื้อทำธุรกรรมการซื้อสินค้าใดๆ สำเร็จ โดยผู้ขายตกลงให้ Moldii App หักค่าธรรมเนียมดังกล่าวออกจากเงินค่าซื้อสินค้าของผู้ซื้อที่ Moldii App จะโอนให้แก่ผู้ขาย (“ค่าธรรมเนียมการขาย”) โดยรายละเอียดเกี่ยวกับการเรียกเก็บค่าธรรมเนียมการขาย อัตราค่าธรรมเนียมการขาย วิธีการคิดคำนวณและเงื่อนไขที่เกี่ยวข้องจะเป็นไปตามข้อกำหนดและเงื่อนไขที่กำหนดไว้ใน นโยบายค่าธรรมเนียม ซึ่งอาจมีการเปลี่ยนแปลงแก้ไขเป็นครั้งคราวตามที่ Moldii App เห็นสมควรและจะแจ้งให้ผู้ขาย/ผู้ใช้ทราบผ่านแพลตฟอร์ม
<br>
(2) ค่าธรรมเนียมการทำธุรกรรม ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะ;
· ค่าธรรมเนียมการทำธุรกรรมผ่านบัตรเครดิตหรือบัตรเดบิต และค่าธรรมเนียมการทำธุรกรรมผ่านบัตรเครดิตแบบผ่อนชำระ<br>
(ก) ค่าธรรมเนียมการทำธุรกรรมผ่านบัตรเครดิตหรือบัตรเดบิต จะถูกจัดเก็บเมื่อผู้ซื้อได้ชำระค่าสินค้าผ่านบัตรเครดิตหรือบัตรเดบิต ไม่ว่าจะชำระเต็มจำนวนหรือชำระแบบผ่อนชำระ โดย Moldii App จะจัดเก็บค่าธรรมเนียมบัตรเครดิตโดยหักค่าธรรมเนียมดังกล่าวออกจากเงินค่าซื้อสินค้าของผู้ซื้อที่ Moldii App จะโอนให้แก่ผู้ขาย (ต่อไปนี้จะเรียกว่า “ค่าธรรมเนียมการทำธุรกรรมผ่านบัตรเครดิตหรือบัตรเดบิต” หรือ “ค่าธรรมเนียมการทำธุรกรรมผ่านบัตรเครดิตแบบผ่อนชำระ” แล้วแต่กรณี) โดยที่ผู้ขายจะเป็นฝ่ายรับผิดชอบค่าธรรมเนียมดังกล่าวนี้แต่เพียงผู้เดียว
<br>
(ข) ค่าธรรมเนียมการทำธุรกรรมผ่านบัตรเครดิตหรือบัตรเดบิต และค่าธรรมเนียมการทำธุรกรรมผ่านบัตรเครดิตแบบผ่อนชำระ จะถูกกำหนดโดย Moldii App รายละเอียดเกี่ยวกับการเรียกเก็บค่าธรรมเนียมการทำธุรกรรมผ่านบัตรเครดิตหรือบัตรเดบิต อัตราค่าธรรมเนียม วิธีการคิดคำนวณและเงื่อนไขที่เกี่ยวข้องเป็นไปตามข้อกำหนดและเงื่อนไขที่กำหนดไว้ใน นโยบายค่าธรรมเนียม ซึ่งอาจมีการเปลี่ยนแปลงแก้ไขเป็นครั้งคราวตามที่ Moldii App เห็นสมควรและจะแจ้งให้ผู้ขาย/ผู้ใช้ทราบผ่านแพลตฟอร์ม
<br>


(ค) ผู้ขายอาจบวกค่าธรรมเนียมการทำธุรกรรมผ่านบัตรเครดิตหรือบัตรเดบิตหรือค่าธรรมเนียมการทำธุรกรรมผ่านบัตรเครดิตแบบผ่อนชำระ ไปในราคาสินค้าที่จำหน่ายได้ ในกรณีดังกล่าวผู้ขายตกลงที่จะไม่เรียกเก็บค่าธรรมเนียมอื่นใดที่เกี่ยวข้องกับการใช้บัตรเครดิตหรือบัตรเดบิต จากผู้ซื้อ Moldii App สงวนสิทธิในการหยุดหรือยกเลิกการให้บริการบัญชีของผู้ขายหากผู้ขายได้ละเมิดเงื่อนไขดังกล่าวนี้
· ค่าธรรมเนียมการทำธุรกรรมประเภทอื่นๆ ตามที่ได้กำหนดไว้ใน นโยบายค่าธรรมเนียม ภายใต้นโยบายของแอพ
<br>
13.2 เมื่อมีการเรียกเก็บค่าธรรมเนียม ค่าธรรมเนียมดังกล่าวอาจมีการคิด GST/VAT และภาษีที่เกี่ยวข้องอื่นๆ รวมเข้าไปด้วย ทั้งนี้ ผู้ขายจะรับผิดชอบค่าภาษีเหล่านั้นเอง เว้นแต่ตกลงกันไว้เป็นอย่างอื่น ผู้ขายรับทราบและตกลงว่า Moldii App อาจหักค่าธรรมเนียมและภาษีที่เกี่ยวข้องจากเงินค่าซื้อสินค้าที่ผู้ซื้อชำระไว้ Moldii App จะออกใบเสร็จรับเงินหรือใบกำกับภาษีสำหรับค่าธรรมเนียมและภาษีที่ผู้ขายชำระไว้เมื่อร้องขอ
<br>
13.3 หากค่าธรรมเนียมใดๆ (รวมภาษีมูลค่าเพิ่ม/VAT) มีตัวเลขทศนิยมเศษสตางค์เกินกว่าหรือเท่ากับ 50 สตางค์ ผู้ขายตกลงให้เรียกเก็บค่าธรรมเนียมดังกล่าวในจำนวนหลังการปัดเศษขึ้นเป็นจำนวนเต็ม และตกลงให้เรียกเก็บค่าธรรมเนียมในจำนวนหลังปัดเศษลงเป็นจำนวนเต็ม หากค่าธรรมเนียม (รวมภาษีมูลค่าเพิ่ม/VAT) มีตัวเลขทศนิยมเศษสตางค์น้อยกว่า 50 สตางค์ และผู้ขายตกลงชำระค่าธรรมเนียมตามจำนวนที่เรียกเก็บนั้นให้แก่ Moldii App
<br>
13.4 Moldii App สงวนสิทธิในการปรับเปลี่ยนค่าธรรมเนียมและอัตราค่าธรรมเนียมใดๆ ที่จะถูกจัดเก็บ ภายหลังจากได้มีการปรับเปลี่ยนค่าธรรมเนียมแล้ว หากคุณยังคงใช้บริการนี้ต่อไป จะถือว่าคุณได้ยอมรับการปรับเปลี่ยนค่าธรรมเนียมดังกล่าวทันที






<br>
<u>14. ความคิดเห็น</u><br>
14.1 Moldii App ยินดีรับฟังทุกความคิดเห็นจากผู้ใช้ ซึ่งจะช่วยให้ Moldii App ปรับปรุงคุณภาพของบริการที่มอบให้ โปรดดูรายละเอียดเพิ่มเติมเกี่ยวกับขั้นตอนการส่งความคิดเห็นด้านล่าง
<br>
(i) สามารถส่งความคิดเห็นเป็นลายลักษณ์อักษรทางอีเมลมายัง หรือใช้แบบฟอร์มความคิดเห็นในแอป
<br>(ii) ไม่รับความคิดเห็นที่ไม่ระบุชื่อผู้ร้องเรียน
<br>(iii) ผู้ใช้ที่ได้รับผลกระทบจากความคิดเห็นควรได้รับแจ้งถึงข้อเท็จจริงอย่างครบถ้วน และได้รับโอกาสให้ทำเรื่องชี้แจง
<br>(iv) ไม่รับความคิดเห็นที่คลุมเครือและทำให้เสื่อมเสีย


















<br>
<u>15. การปฏิเสธความรับผิดชอบ</u>
<br>
15.1 บริการนี้จัดไว้ให้ “ตามสภาพจริง” โดยไม่มีการรับประกัน การอ้างสิทธิ์ หรือการรับรองโดย Moldii App ไม่ว่าในลักษณะใด ทั้งแบบชัดแจ้ง โดยนัย หรือแบบบังคับ อันเกี่ยวเนื่องกับบริการ รวมถึงแต่ไม่จำกัดเพียง การรับประกันคุณภาพ การดำเนินงาน การไม่ละเมิดสิทธิ ความสามารถในการทำการค้า หรือความเหมาะสมสำหรับวัตถุประสงค์เฉพาะ รวมทั้งไม่มีการรับประกันที่เกิดขึ้นระหว่างการติดต่อ การดำเนินงาน หรือการใช้เพื่อการค้า โดยไม่เป็นการจำกัดสิ่งที่กล่าวไปก่อนหน้านี้ และจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ Moldii App ไม่รับประกันว่า บริการ ไซต์นี้ หรือการทำงานในไซต์จะพร้อมใช้งานได้ เข้าถึงได้ ไม่หยุดชะงัก ทันต่อเวลา ปลอดภัย ถูกต้อง ครบถ้วน หรือปราศจากข้อผิดพลาด ว่าข้อบกพร่อง หากมี จะได้รับการแก้ไข หรือว่า ไซต์นี้และ/หรือเซิร์ฟเวอร์ของไซต์จะใช้งานได้โดยปราศจากไวรัส นาฬิกา ระบบตั้งเวลา ตัวนับ หนอน ล็อคซอฟต์แวร์ อุปกรณ์สอดแนม ม้าโทรจัน เราติ้ง ประตูกับดัก ระเบิดเวลา หรือรหัส คำสั่ง โปรแกรม หรือส่วนประกอบที่เป็นอันตรายอื่นใด
<br>
15.2 คุณรับทราบว่าความเสี่ยงทั้งหมดที่เกิดขึ้นจากการใช้หรือการดำเนินงานของไซต์นี้และ/หรือบริการ ตกเป็นของคุณจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้
<br>
15.3 Moldii App ไม่ได้ควบคุมและ จนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่รับประกันหรือรับผิดชอบต่อ: (ก) ความเหมาะสมเพื่อวัตถุประสงค์ การมีอยู่ คุณภาพ ความปลอดภัยหรือความชอบด้วยกฎหมายของสินค้าที่วางจำหน่ายผ่านทางบริการ หรือ (ข) ความสามารถของผู้ขายในการขายสินค้าหรือของผู้ซื้อในการชำระค่าสินค้า หากมีข้อพิพาทที่เกี่ยวกับผู้ใช้ตั้งแต่หนึ่งคนขึ้นไป ผู้ใช้ดังกล่าวตกลงที่จะยุติข้อพิพาทระหว่างกันโดยตรง และจนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ปลดปล่อย Moldii App และบริษัทในเครือออกจากการอ้างสิทธิ การเรียกร้อง และความเสียหายใดๆ และทั้งหมด อันเกิดจากหรือเกี่ยวเนื่องกับข้อพิพาทดังกล่าว







<br>
<u>16. ข้อยกเว้นและข้อจำกัดการรับผิด</u><br>
16.1 จนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่ว่าในสถานการณ์ใดก็ตาม Moldii App จะไม่รับผิดไม่ว่าตามสัญญา การรับประกัน การละเมิด (รวมถึง แต่ไม่จำกัดเพียง ความประมาทเลินเล่อ (ไม่ว่าในเชิงรุก เชิงรับ หรือถูกใส่ความ) ความรับผิดของผลิตภัณฑ์ ความรับผิดโดยสิ้นเชิงหรือทฤษฎีอื่น) หรือประเด็นฟ้องอื่นตามกฎหมาย ตามความเที่ยงธรรม ตามบทกฎหมาย หรืออื่นใด ต่อ:
<br>
16.1.1 (ก) การสูญเสียการใช้งาน (ข) การสูญเสียกำไร (ค) การสูญเสียรายได้ (ง) การสูญเสียข้อมูล (จ) การสูญเสียค่าความนิยม หรือ (ฉ) การล้มเหลวในการรับรู้เงินออมที่คาดการณ์ไว้ ในแต่ละกรณีทั้งในทางตรงและทางอ้อม หรือ
<br>
16.1.2 ความเสียหายทางอ้อม โดยบังเอิญ พิเศษ หรือที่เป็นผลตามมา
ที่เกิดจากหรือเกี่ยวเนื่องกับการใช้หรือการไม่สามารถใช้ไซต์นี้หรือบริการ รวมถึงแต่ไม่จำกัดเพียง ความเสียหายอันเกิดจากสิ่งดังกล่าว แม้ว่า Moldii App จะได้รับแจ้งถึงความเป็นไปได้ของความเสียหายดังกล่าวแล้วก็ตาม
<br>
16.2 คุณรับทราบและตกลงว่าสิทธิเพียงอย่างเดียวที่คุณมีเกี่ยวกับปัญหาหรือความไม่พึงพอใจใดๆ ในบริการคือการขอให้ยกเลิกบัญชีของคุณ และ/หรือหยุดใช้งานบริการ
<br>
16.3 ถ้า โดยไม่คำนึงถึงความในส่วนก่อนหน้า Moldii App ถูกศาลหรือเขตอำนาจศาลที่มีอำนาจสั่งให้ต้องรับผิด (รวมถึงต่อการประมาทเลินเล่ออย่างร้ายแรง) จนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ความรับผิดต่อคุณหรือบุคคลภายนอกใดๆ จะจำกัดอยู่ที่น้อยกว่าสิ่งต่อไปนี้ (ก) จำนวนเงินที่ต้องชำระให้แก่คุณตาม บริษัท เพลินพอดี และ (ข) SG $100 (หนึ่งร้อยดอลลาร์สิงคโปร์)
<br>
16.4 ไม่มีสิ่งใดในเงื่อนไขการให้บริการนี้ที่จะจำกัดหรือยกเว้นความรับผิดต่อการเสียชีวิต หรือการบาดเจ็บร่างกายอันเกิดจากความประมาทเลินเล่อของ Moldii App การฉ้อโกง หรือต่อความรับผิดอื่นใดในส่วนของ Moldii App ที่ไม่สามารถจำกัดและ/หรือยกเว้นได้ตามกฎหมาย

<br>

<u>17. ลิงก์ไปยังไซต์ของบุคคลภายนอกและแชร์วิดีโอจาก YouTube</u>
<br>
17.1 ลิงก์ของบุคคลภายนอกซึ่งมีอยู่ทั่วทั้งไซต์ จะให้คุณสามารถออกจากไซต์นี้ได้ ลิงก์เหล่านี้จัดไว้ให้ตามมารยาทเท่านั้น และไซต์ที่มีลิงก์ไปไม่ได้อยู่ภายใต้การควบคุมของ Moldii App ไม่ว่าในลักษณะใด และคุณเข้าถึงไซต์เหล่านี้ด้วยความเสี่ยงของคุณเอง Moldii App ไม่รับผิดชอบไม่ว่ากรณีใดต่อเนื้อหาของไซต์ที่ลิงก์ไปดังกล่าว หรือลิงก์ที่อยู่ในไซต์ที่มีลิงก์ไป รวมถึงการเปลี่ยนแปลงหรือการอัปเดตไซต์ดังกล่าว Moldii App จัดลิงก์เหล่านี้ไว้ให้เพื่อความสะดวกเท่านั้น และการรวมลิงก์ใดๆ ไว้ไม่ได้แสดงนัยหรือการเชื่อมโยงอย่างชัดแจ้ง การรับรอง หรือการเป็นผู้สนับสนุนโดย Moldii App ถึงไซต์ที่ลิงก์ไปใดๆ และ/หรือเนื้อหาในไซต์ที่ลิงก์ไปนั้น
<br>
17.2 Moldii App อนุญาตให้คุณสามารถแชร์วิดีโอจาก YouTube ใน Moldii App (“เนื้อหาของ YouTube”) โดยการแชร์เนื้อหาของ YouTube คุณตกลงผูกพันที่จะปฏิบัติตามเงื่อนไขการให้บริการของ YouTube 
















<br>

<u>18. การมีส่วนร่วมของคุณต่อบริการ</u>
<br>
18.1 การส่งเนื้อหาเพื่อรวมไว้ในบริการ แสดงว่าคุณรับรองและรับประกันว่าคุณมีสิทธิและ/หรือการอนุญาตที่จำเป็นทั้งหมดเพื่อมอบสิทธิ์การใช้งานด้านล่างแก่ Moldii App คุณยังรับทราบและตกลงต่อไปว่า คุณคือผู้รับผิดชอบแต่เพียงผู้เดียวต่อสิ่งใดก็ตามที่คุณโพสต์หรือทำให้ใช้งานได้บนหรือผ่านทางบริการ รวมถึงแต่ไม่จำกัดเพียง ความถูกต้อง ความน่าเชื่อถือ ลักษณะ การปลอดจากสิทธิ์ การตรงตามกฎหมายและข้อจำกัดทางกฎหมาย ที่เกี่ยวข้องกับเนื้อหาที่ส่งเข้ามา คุณมอบสิทธิ์การใช้งานตลอดกาล ที่เพิกถอนไม่ได้ เป็นสากล ไม่ผูกขาด ปลอดค่าลิขสิทธิ์ สามารถมอบสิทธิต่อไปได้ และเปลี่ยนมือได้ ให้แก่ Moldii App และผู้รับช่วงต่อ ในการใช้ คัดลอก แจกจ่าย เผยแพร่ซ้ำ ส่งต่อ ดัดแปลง ปรับเปลี่ยน สร้างงานอนุพันธ์จาก แสดงแก่สาธารณะ และดำเนินการต่อสาธารณะ เนื้อหาที่ส่งเข้ามาดังกล่าวบน ผ่านทางหรือที่เกี่ยวเนื่องกับบริการ ในรูปแบบสื่อใดๆ และผ่านช่องทางสื่อใด รวมถึงแต่ไม่จำกัดเพียง เพื่อการส่งเสริมการขายและแจกจ่ายต่อส่วนต่างๆ ของบริการ (และงานอนุพันธ์ของบริการ) โดยไม่ต้องมีอำนาจหน้าที่ที่ได้รับมอบหมาย และคุณตกลงที่จะสละสิทธิทางศีลธรรมใดๆ (และสิทธิที่คล้ายกันในส่วนต่างๆ ทั่วโลก) ในเรื่องดังกล่าว คุณเข้าใจว่าสิ่งที่คุณส่งเข้ามานั้นอาจถูกส่งต่อทางเครือข่ายต่างๆ และถูกเปลี่ยนเพื่อให้ตรงตามและปรับให้เข้ากับข้อกำหนดทางเทคนิค
<br>
18.2 วัสดุ ข้อมูล หรือแนวคิดใดที่คุณโพสต์บนหรือผ่านทางบริการ หรือส่งต่อมายัง Moldii App ไม่ว่าด้วยวิธีใด (เรียกว่า “สิ่งที่ส่งมา”) ไม่ถือว่าเป็นความลับโดย Moldii App และอาจถูกเผยแพร่หรือใช้โดย Moldii App โดยปราศจากการชดเชยหรือการรับผิดต่อคุณ ไม่ว่าด้วยจุดประสงค์ใดก็ตาม รวมถึงแต่ไม่จำกัดเพียง การพัฒนา การผลิต และการทำตลาดผลิตภัณฑ์ ในการส่งสิ่งที่ส่งมาแก่ Moldii App คุณรับทราบและตกลงว่า Moldii App และ/หรือบุคคลภายนอกอื่นๆ อาจพัฒนาซอฟต์แวร์ แอปพลิเคชัน อินเทอร์เฟส ผลิตภัณฑ์ และส่วนปรับปรุงของสิ่งดังกล่าวโดยอิสระ ซึ่งมีลักษณะการทำงาน รหัส หรือลักษณะพิเศษอื่นตรงหรือคล้ายกับแนวคิดที่กำหนดไว้ในสิ่งที่ส่งมาของคุณ ดังนั้นคุณจึงได้มอบสิทธิ์การใช้งานตลอดกาล ที่เพิกถอนไม่ได้ เป็นสากล ไม่ผูกขาด ปลอดค่าลิขสิทธิ์ สามารถมอบสิทธิต่อไปได้ และเปลี่ยนมือได้ ให้แก่ Moldii App และผู้รับช่วงต่อ ในการพัฒนาสิ่งที่ระบุไว้ข้างตน และเพื่อใช้ คัดลอก แจกจ่าย เผยแพร่ซ้ำ ส่งต่อ ดัดแปลง ปรับเปลี่ยน สร้างงานอนุพันธ์จาก แสดงแก่สาธารณะ และดำเนินการต่อสาธารณะ สิ่งที่ส่งมาดังกล่าวบน ผ่านทางหรือที่เกี่ยวเนื่องกับบริการ ในรูปแบบสื่อใดๆ และผ่านช่องทางสื่อใด รวมถึงแต่ไม่จำกัดเพียง เพื่อการส่งเสริมการขายและแจกจ่ายต่อส่วนต่างๆ ของบริการ (และงานอนุพันธ์ของบริการ) โดยไม่ต้องมีอำนาจหน้าที่ที่ได้รับมอบหมาย และคุณตกลงที่จะสละสิทธิทางศีลธรรมใดๆ (และงานอนุพันธ์จากบริการ) ข้อกำหนดนี้ไม่ใช้บังคับกับข้อมูลส่วนบุคคลที่ต้องอยู่ภายใต้นโยบายความเป็นส่วนตัวของเรา เว้นแต่ในขอบเขตที่คุณทำให้ข้อมูลส่วนบุคคลดังกล่าวใช้งานได้แก่สาธารณะบนหรือผ่านทางบริการ


<br>
<u>19. การมีส่วนร่วมของบุคคลภายนอกต่อบริการและลิงก์ภายนอก</u>
<br>
19.1 ผู้มีส่วนร่วมในบริการแต่ละคน ในด้านข้อมูล ข้อความ ภาพ เสียง วิดีโอ ซอฟต์แวร์ และเนื้อหาอื่นๆ เป็นผู้รับผิดชอบแต่เพียงผู้เดียวต่อความถูกต้อง ความน่าเชื่อถือ ลักษณะ การปลอดจากสิทธิ์ การตรงตามกฎหมายและข้อจำกัดทางกฎหมาย ที่เกี่ยวข้องกับเนื้อหาที่ส่งเข้ามา ดังนั้น Moldii App จะไม่รับผิดชอบต่อ และจะไม่เฝ้าติดตามหรือตรวจสอบอย่างสม่ำเสมอถึงความถูกต้อง ความน่าเชื่อถือ ลักษณะ การปลอดจากสิทธิ์ การตรงตามกฎหมายและข้อจำกัดทางกฎหมาย ที่เกี่ยวข้องกับเนื้อหาที่ส่งเข้ามา คุณจะไม่กำหนดให้ Moldii App ต้องรับผิดชอบต่อการดำเนินการหรือไม่ดำเนินการของผู้ใช้ รวมถึงแต่ไม่จำกัดเพียง สิ่งที่โพสต์หรือทำให้ใช้งานได้ผ่านทางบริการ
<br>
19.2 นอกจากนี้ บริการอาจมีลิงก์ไปยังผลิตภัณฑ์ เว็บไซต์ บริการและข้อเสนอของบุคคลภายนอก ลิงก์ ผลิตภัณฑ์ เว็บไซต์ บริการของบุคคลภายนอกเหล่านี้ไม่ได้เป็นของหรือควบคุมโดย Moldii App แต่ดำเนินการโดย และเป็นทรัพย์สินของบุคคลภายนอกที่เกี่ยวข้อง และอาจได้รับการคุ้มครองตามกฎหมายลิขสิทธิ์หรือกฎหมายและสนธิสัญญาว่าด้วยทรัพย์สินทางปัญญาอื่นๆ ที่บังคับใช้ Moldii App ไม่ได้ตรวจสอบ และไม่รับผิดชอบต่อเนื้อหา ฟังก์ชั่นการทำงาน ความปลอดภัย บริการ นโยบายความเป็นส่วนตัว หรือการปฏิบัติอื่นๆ ของบุคคลภายนอกเหล่านี้ ขอแนะนำให้อ่านข้อกำหนดและนโยบายอื่นๆ ที่เผยแพร่บนเว็บไซต์หรืออื่นๆ โดยบุคคลภายนอกดังกล่าว ในการใช้บริการ คุณตกลงว่า Moldii App จะไม่รับผิดชอบในลักษณะใดก็ตามอันเนื่องมาจากการใช้งานของคุณหรือการไม่สามารถใช้งานเว็บไซต์หรือวิดเจ็ตใดๆ คุณรับทราบและตกลงต่อไปด้วยว่า Moldii App อาจยกเลิกการใช้งานของคุณ หรือลบลิงก์ของบุคคลภายนอก หรือแอปพลิเคชันบนบริการ ตามขอบเขตที่การใช้งานนั้นละเมิดเงื่อนไขการให้บริการนี้









<br>

<u>20. การรับรองและการรับประกันของคุณ</u>
<br>
คุณรับรองและรับประกันว่า:<br>
<br>(ก) คุณบรรลุนิติภาวะ (และในกรณีของผู้เยาว์ ได้รับความยินยอมจากพ่อแม่หรือผู้ปกครองตามกฎหมาย) มีสิทธิและความสามารถที่จะเข้าทำสัญญาเงื่อนไขการให้บริการนี้และปฏิบัติตามเงื่อนไขนี้ และ
<br>(ข) คุณจะใช้บริการเพื่อจุดประสงค์ที่ถูกกฎหมายและตามเงื่อนไขการให้บริการนี้ และกฎหมาย กฎระเบียบ ประมวลกฎหมาย คำสั่ง แนวทางปฏิบัติ นโยบายและข้อบังคับที่บังคับใช้ทั้งหมด





















<br>
<u>21. การกระทำอันเป็นการฉ้อโกงหรือการกระทำที่ต้องสงสัย</u>
<br>
โดยใช้ดุลยพินิจของ Moldii App แต่เพียงผู้เดียว หาก Moldii App มีเหตุอันควรเชื่อได้ว่าคุณได้กระทำการหรือทำธุรกรรมใดๆ ที่อาจเป็นการฉ้อโกงหรือเป็นที่ต้องสงสัย เราอาจจะดำเนินมาตรการต่างๆ เพื่อปกป้อง Moldii App ผู้ซื้อหรือผู้ขายคนอื่นๆ หรือบุคคลภายนอกจากการคืนเงิน (reversals) การปฏิเสธการจ่ายเงิน (chargebacks) การคัดค้านการจ่ายเงิน (claims) ค่าธรรมเนียม ค่าปรับ เบี้ยปรับและความรับผิดอื่นใด มาตรการที่เราอาจจะดำเนินการได้แก่
<br>
(ก) เราอาจจะปิด ระงับหรือจำกัดการเข้าถึงบัญชีของคุณหรือการให้บริการ และ/หรือระงับการทำธุกรรมใดๆ<br>
(ข) เราอาจจะระงับสิทธิของคุณสำหรับ บัญชี<br>
<br>(ค) เราอาจจะถือครองไว้ ใช้หรือโอนเงินที่อยู่ในบัญชีของคุณตามคำพิพากษาและคำสั่งที่เกี่ยวข้องกับคุณหรือบัญชีของคุณ ซึ่งรวมถึงคำพิพากษาและคำสั่งของศาลของประเทศสิงคโปร์หรือที่อื่นใดที่เกี่ยวข้องกับ Moldii App
(ง) เราอาจปฏิเสธการให้บริการแก่คุณทันทีหรือในอนาคต<br>
<br>(จ) เราอาจจะถือครองเงินของท่านในระยะเวลาที่จำเป็นต่อการป้องกันความเสี่ยงที่อาจก่อให้เกิดความรับผิดต่อ Moldii App หรือบุคคลภายนอก หรือกรณีที่เรามีความเชื่อมั่นว่าคุณได้กระทำการหรือทำธุรกรรมใดๆ ที่อาจเป็นการฉ้อโกงหรือเป็นที่ต้องสงสัย
<br>
เพื่อวัตถุประสงค์ในการตีความในข้อนี้
<br>“การปฏิเสธการจ่ายเงิน (chargebacks)” หมายถึง คำร้องเรียนที่ผู้ซื้อยื่นต่อบริษัทบัตรเดบิตหรือบัตรเครดิตของผู้ซื้อหรือธนาคารที่ออกบัตรเดบิตหรือบัตรเครดิตเพื่อทำให้การจ่ายเงินเป็นโมฆะ
<br>“การคัดค้านการจ่ายเงิน (claims)” หมายถึง การคัดค้านการจ่ายเงินที่ผู้ซื้อหรือผู้ขายได้แจ้งต่อ Moldii App โดยตรง
<br>“การคืนเงิน (reversals)” หมายถึง การคืนเงินค่าสินค้าโดย Moldii App เนื่องจาก (ก) ธนาคารของผู้ร้องขอได้ทำให้การจ่ายเงินดังกล่าวเป็นโมฆะ (ข) Moldii App ได้นำส่งค่าสินค้าแก่คุณโดยผิดพลาด (ค) ผู้นำส่งค่าสินค้าไม่ได้รับอนุญาตให้นำส่งค่าสินค้าดังกล่าว (ตัวอย่างเช่น ผู้นำส่งได้ใช้บัตรเครดิตที่ถูกขโมย) (ง) คุณได้รับค่าสินค้าจากการกระทำที่เป็นอันฝ่าฝืนข้อกำหนดการให้บริการนี้ หรือ (จ) Moldii App ประสงค์ที่จะคัดค้านการจ่ายเงินกับคุณ



<br>
<u>22. การชดใช้ค่าเสียหาย</u>
<br>
22.1 คุณตกลงที่จะชดใช้ ปกป้องและทำให้ Moldii App ผู้ถือหุ้น บริษัทย่อย บริษัทในเครือ กรรมการ เจ้าหน้าที่ ตัวแทน ผู้ร่วมแบรนด์ หรือหุ้นส่วนอื่น และพนักงาน (เรียกรวมว่า “ฝ่ายที่ได้รับการชดใช้”) พ้นจากการเรียกร้องสิทธิ การดำเนินการ การดำเนินคดี และการฟ้องร้องคดี รวมถึงหนี้สิน ความเสียหาย การชำระหนี้ บทลงโทษ ค่าปรับ ค่าใช้จ่ายและต้นทุนที่เกี่ยวข้องทั้งหมด (รวมถึงแต่ไม่จำกัดเพียง ค่าใช้จ่ายในการยุติข้อพิพาทอื่นๆ) ที่เกิดแก่ฝ่ายที่ได้รับการชดใช้ อันเกิดจากหรือเกี่ยวข้องกับ: (ก) ธุรกรรมใดๆ ที่ทำขึ้นบนไซต์ หรือข้อพิพาทใดๆ ที่เกี่ยวข้องกับธุรกรรมดังกล่าว เว้นแต่กรณีที่ Moldii App หรือบริษัทในเครือเป็นผู้จำหน่ายสินค้าในธุรกรรมที่เกี่ยวข้องกับข้อพิพาทดังกล่าว) (ข) Moldii App (ค) การโฮสต์ การดำเนินงาน การจัดการและ/หรือการดูแลระบบบริการ โดยหรือในนามของ Moldii App (ง) การฝ่าฝืนหรือละเมิดเงื่อนไขใดๆ ในเงื่อนไขการให้บริการนี้และนโยบายหรือแนวทางปฏิบัติอื่นใดที่อ้างถึงในที่นี่ (จ) การใช้หรือใช้บริการในทางที่ผิด หรือ (ฉ) การละเมิดกฎหมายหรือสิทธิใดๆ ของบุคคลภายนอก

















<br>
<u>23. การแยกออกจากกันได้</u>
<br>
หากบทบัญญัติใดในเงื่อนไขการให้บริการนี้ถือว่าผิดกฎหมาย เป็นโมฆะ หรือไม่สามารถบังคับใช้ได้ไม่ว่าด้วยเหตุผลใดภายใต้กฎหมายของเขตอำนาจศาลใด ให้ถือว่าบทบัญญัตินั้นสามารถแยกออกจากกันได้จากข้อกำหนดและเงื่อนไขนี้ และไม่ส่งผลต่อความสมบูรณ์และการมีผลบังคับใช้ของบทบัญญัติที่เหลือ หรือความสมบูรณ์และการมีผลบังคับใช้ของบทบัญญัติที่มีปัญหาภายใต้กฎหมายของเขตอำนาจศาลอื่นใด






















<br>
<u>24. บทบัญญัติทั่วไป</u>
<br>
24.1 Moldii App สงวนสิทธิ์ทั้งหมดที่ไม่ได้ให้ไว้โดยชัดแจ้งในที่นี้
<br>
24.2 Moldii App อาจแก้ไขเงื่อนไขการให้บริการนี้ได้ตลอดเวลาโดยโพสต์เงื่อนไขการให้บริการฉบับแก้ไขบนไซต์นี้ การใช้งานไซต์นี้ต่อไปของคุณหลังการเปลี่ยนแปลงดังกล่าวจะถือว่าคุณยอมรับเงื่อนไขการให้บริการฉบับแก้ไขนั้นแล้ว
<br>
24.3 คุณต้องไม่มอบหมาย ให้สิทธิ์การใช้งานต่อ หรือโอนสิทธิที่มอบให้แก่คุณในที่นี้หรือทำสัญญาช่วงข้อผูกพันใดๆ ของคุณ
<br>
24.4 ไม่มีสิ่งใดในเงื่อนไขการให้บริการนี้จะถือเป็นการเป็นหุ้นส่วน การลงทุนร่วม หรือความสัมพันธ์ระหว่างตัวการกับตัวแทน ระหว่างคุณและ Moldii App และไม่มีสิ่งใดอนุญาตให้คุณสร้างภาระค่าใช้จ่ายหรือหนี้สินในนามของ Moldii App
<br>
24.5 ความล้มเหลวของ Moldii App ไม่ว่าเวลาใด ที่จะบังคับใช้บทบัญญัติใดของเงื่อนไขนี้ ไม่ส่งผลไม่ว่าในทางใดต่อสิทธิของตนในภายหลังที่จะบังคับใช้บทบัญญัติดังกล่าว เว้นแต่มีการสละสิทธิ์ไว้เป็นลายลักษณ์อักษร
<br>
24.6 เงื่อนไขการให้บริการนี้มีไว้เพื่อคุณและประโยชน์ของเราเท่านั้น และไม่ใช่เพื่อประโยชน์ของบุคคลหรือนิติบุคคลอื่นใด เว้นแต่บริษัทย่อยและบริษัทในเครือของ Moldii App (และผู้รับช่วงและผู้รับมอบหมายของบริษัทย่อยและบริษัทในเครือที่เกี่ยวข้องของ Moldii App แต่ละแห่ง)
<br>
24.7 เงื่อนไขที่กำหนดไว้ในเงื่อนไขการให้บริการนี้และข้อตกลงรวมถึงนโยบายใดๆ ที่รวมอยู่ในหรืออ้างถึงในเงื่อนไขการให้บริการนี้ ถือเป็นข้อตกลงที่สมบูรณ์ และความเข้าใจของคู่สัญญาอันเกี่ยวกับบริการและไซต์ และใช้แทนที่ข้อตกลงหรือความเข้าใจก่อนหน้านี้ระหว่างคู่สัญญาซึ่งเกี่ยวข้องกับเรื่องดังกล่าว ดังนั้นคู่สัญญาจึงยกเว้นเงื่อนไขโดยนัยทั้งหมดตามข้อเท็จจริง ในการเข้าทำข้อตกลงที่เกิดจากเงื่อนไขการให้บริการนี้นั้น คู่สัญญาไม่ได้พึ่งพาถ้อยแถลง การรับรอง การรับประกัน ความเข้าใจ ภาระหน้าที่ คำสัญญา หรือคำมั่นจากบุคคลใดนอกเหนือจากที่ระบุไว้อย่างชัดแจ้งในเงื่อนไขการให้บริการนี้ คู่สัญญาแต่ละฝ่ายสละการเรียกร้องที่เพิกถอนไม่ได้และไม่มีเงื่อนไข สิทธิและการเยียวยาทั้งหมด ซึ่งแต่สำหรับส่วนนี้ ตนอาจมีอันเกี่ยวเนื่องกับสิ่งใดที่กล่าวมาก่อนหน้านี้ เงื่อนไขการให้บริการนี้ไม่อาจโต้แย้ง อธิบาย หรือเสริมด้วยหลักฐานข้อตกลงก่อนหน้า ข้อตกลงปากเปล่าซึ่งเกิดขึ้นพร้อมกัน หรือเงื่อนไขเพิ่มเติมที่สอดคล้องกันใดๆ
<br>


24.8 คุณตกลงที่จะปฏิบัติตามกฎหมาย บทกฎหมาย ข้อบังคับและประมวลกฎหมายที่บังคับใช้ทั้งหมด ที่เกี่ยวกับการต่อต้านการติดสินบนและการทุจริต รวมถึงแต่ไม่จำกัดเพียงพระราชบัญญัติการติดสินบนของสหราชอาณาจักร กฎหมายป้องกันการทุจริตในต่างประเทศของสหรัฐฯ และกฎหมายป้องกันการทุจริตของสิงคโปร์ รวมทั้งยืนยันว่าคุณได้และจะกำหนดนโยบายและระเบียบทั้งหมดที่จำเป็นเพื่อรับรองการปฏิบัติตามข้อกำหนดดังที่ว่านี้
<br>
24.9 หากมีคำถามหรือข้อกังวลเกี่ยวกับเงื่อนไขการให้บริการนี้ หรือมีปัญหาที่เกิดจากเงื่อนไขการให้บริการนี้หรือบนไซต์ โปรดติดต่อเราที่: moldiiapp@gmail.com 






<br><br><br><br><br>
ฉบับวันที่ 22 สิงหาคม 2565

    </div>





@endsection

@section('custom_script')
<script>
    bottom_now(7);
</script>
@endsection