@extends('mobile.main_layout.guest')
<style>
    #bg {
        position: fixed; 
        top: -50%; 
        left: -50%; 
        width: 200%; 
        height: 200%;
    }
    #bg img {
        position: absolute; 
        top: 0; 
        left: 0; 
        right: 0; 
        bottom: 0; 
        margin: auto; 
        min-width: 50%;
        min-height: 50%;
    }
</style>
@section('content')
<div id="bg">
    <img src="{{asset('new_assets/img/login_new.JPG')}}" alt="">
</div>
<br>

    <div class="m-1">
        <div class="row align-items-center">
            <div class="col-12 text-left">
                <a href="{{url('/user/login')}}"><ion-icon name="arrow-back-outline" class="text-dark font-weight-bold" style="color: black; margin-top: 25px; font-size: 25px;"></ion-icon></a>
            </div>


            <div class="col-7 text-right " style="margin-top: 100px;">
                <h1 class="">
                    สมัครสมาชิก
                </h1>
            </div>

            
            <div class="col-5 text-center" style="margin-top: 100px;">
                <div class="m-1">

                    <a href="{{route('redirectToProvider','google')}}"> <img src="{{asset('new_assets/custom_assets/contact_icons/google_logo.png')}}" class="m-1 p-1 bg-white rounded custom_hover" style="weight:45px; height:45px;"></a>
                    <a href="{{route('redirectToProvider','facebook')}}"><img src="{{asset('new_assets/custom_assets/contact_icons/facebook_logo.png')}}" class="m-1 p-1 bg-white rounded custom_hover" style="weight:45px; height:45px;"></a>

                </div>
            </div>
            <form action="{{url('checkregister')}}" method="POST" class="form-group row" id="formregis">
                @csrf
                <div class="col-10 offset-1 text-center">
                    <input type="text" class="form-control form-control-lg my-1" style="border-radius: 10px;" name="firstname" id="firstname" value="" placeholder="ชื่อ">
                </div>
                <div class="col-10 offset-1 text-center">
                    <input type="text" class="form-control form-control-lg my-1" style="border-radius: 10px;" name="lastname" id="lastname" value="" placeholder="นามสกุล">
                </div>
                <div class="col-10 offset-1 text-center">
                    <input type="text" class="form-control form-control-lg my-1" style="border-radius: 10px;" name="username" id="username" value="" onchange="checkusername(this.value);" placeholder="ชื่อผู้ใช้">
                </div>
                {{-- <div class="col-10 offset-1 text-center">
                    <input type="text" class="form-control form-control-lg my-1" style="border-radius: 10px;" name="mn" id="mn" value="" onchange="checkmn(this.value);" placeholder="เบอร์โทรศัพท์ (ใช้ในการรับ OTP)">
                </div> --}}
                <div class="col-10 offset-1 text-center">
                    <input type="password" class="form-control form-control-lg my-1" style="border-radius: 10px;" name="password" id="password" value="" minlength="8" placeholder="รหัสผ่าน">
                </div>
                <div class="col-12  offset-1 mt-1 ">
                    <input type="checkbox" class="mr-1" name="chk" id="chk" required>
                    <a href="javascript;:" style="color: black" data-toggle="modal" data-target="#exampleModal"><u>ยอมรับเงื่อนไขการให้บริการ</u> <br>และ <u>นโยบายความเป็นส่วนตัว</u> ของ Moldii</a>
                </div>
                <div class="col-5 offset-1 text-center">
                    <input type="button" class="btn btn-index btn-block font-weight-bold my-3 rounded-pill" 
                                        style="font-size: 18px; align-items: center; height: 50px;" value="สมัครสมาชิก" 
                                        id="subbutton" onclick="subform();">
                </div>
                
                <div class="col-6 text-left">
                    <div class = "row align-items-center my-3">
                        <div class = "col-12 mt-2">
                            <span class="custom_hover font-weight-bold" style="font-size: 16px;">
                                มีบัญชีแล้ว ? <a href="{{url('user/login')}}">เข้าสู่ระบบ</a>
                            </span>
                        </div>
                        {{-- <div class = "col-12">
                            <span class="custom_hover" style="font-size: 16px; font-weight: bold;">
                                <a href="{{url('user/login')}}">เข้าสู่ระบบ</a>
                            </span>
                        </div> --}}
                        
                        
                    </div>
                </div>
            </form>


        </div>

    </div>

    <div class="modal" tabindex="-1" role="dialog" id="exampleModal" >
        <div class="modal-dialog" role="document">
          <div class="modal-content">
            <div class="modal-header">
              <h5 class="modal-title">นโยบายคุ้มครองข้อมูลส่วนบุคคล Moldii App</h5>
              <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                <span aria-hidden="true">&times;</span>
              </button>
            </div>
            <div class="modal-body">
              <p>
                        Moldii App ( ซึ่งต่อไปในนโยบายนี้จะเรียกว่า “ บริษัท ”) ขอแนะนำให้ทราบถึงนโยบายส่วนบุคคล (privacy policy) นี้ของบริษัท ซึ่งนโยบายจะอธิบายถึงวิธีการที่ทางบริษัทปฏิบัติต่อข้อมูลส่วนบุคคลของท่าน เช่น การจัดเก็บเก็บข้อมูลส่วนบุคคล การนำไปใช้ การเปิดเผยข้อมูลเพื่อสิทธิประโยชน์ของผู้ให้บริการ เป็นต้น บริษัทจึงประกาศนโยบายส่วนบุคคล โดยมีรายละเอียดดังต่อไปนี้
                        <br>
                        <u>ข้อมูลส่วนบุคคล</u><br>
                        • ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ ไม่ว่าโดยทางตรงหรือทางอ้อมตาม กฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล
                        <br>
                        <u>ข้อมูลส่วนบุคคลทั่วไปที่เก็บรวบรวม</u>
                        <br>• ข้อมูลส่วนบุคคลที่เกี่ยวกับผู้ใช้บริการเป็นการทั่วไป เช่น ชื่อ-นามสกุล เลขบัตรประจำตัว ประชาชน วันเกิด อายุ อาชีพ เพศ สถานภาพทางการสมรส รูปถ่าย หมายเลขโทรศัพท์บ้าน หมายเลขโทรศัพท์เคลื่อนที่ อยู่ตามทะเบียนบ้าน ที่อยู่เพื่อจัดส่งไปรษณีย์ เลขที่หนังสือเดินทาง อีเมล เสียงสนทนา ไอดีไลน์ และรายละเอียดข้อมูลติดต่ออื่น ๆ เป็นต้น
                        <br>• ข้อมูลทางการเงิน เช่น ข้อมูลบัญชีธนาคาร รายละเอียดเกี่ยวกับบัตรเครดิต และรายละเอียด หรือข้อมูลเกี่ยวกับการชำระเงินอื่น ๆ เป็นต้น
                        <br>• ข้อมูลทางเทคนิค และกิจกรรมส่วนบุคคล เมื่อผู้ใช้บริการใช้เว็บไซต์ แอปพลิเคชันของบริษัท และอาจรวมถึงแพลตฟอร์มสื่อสังคมออนไลน์ของผู้ให้บริการอื่น ชื่อเรียกตัวตนเฉพาะของลูกค้าที่ใช้บนแพลตฟอร์มสื่อสังคมออนไลน์ IP Address คุกกี้ (cookies) ประเภทและเวอร์ชั่นของเบราว์เซอร์
                        <br> • ข้อมูลส่วนบุคคลอื่นๆ ตามที่กฎหมายระบุให้ต้องขอความยินยอมจากผู้ใช้บริการและก่อนทำ การเก็บรวบรวม ทางบริษัทจะแจ้งให้ผู้ใช้บริการทราบและขอความยินยอมจากผู้ใช้บริการก่อนทำการเก็บข้อมูล หรือตามระยะเวลาที่กฎหมายกำหนด
                        
                        <br>
                        <u>ข้อมูลส่วนบุคคลที่มีความอ่อนไหวที่เก็บรวบรวม</u><br>
                        • ข้อมูลส่วนบุคคลที่มีความอ่อนไหว(Sensitive Personal Data) ที่บริษัทจำเป็นในการเก็บ รวบรวม ซึ่งข้อมูลที่จำเป็นต่อการพิจารณารับบริการต่าง ๆ ของบริษัท ตลอดจนการให้บริการหรือคุณสมบัติการร่วมโปรโมชั่น รวมไปถึงรางวัลและ/หรือโบนัสต่าง ๆ หากผู้ใช้บริการไม่ยินยอมให้บริการประมวลผลข้อมูลส่วนบุคคลที่มีความอ่อนไหวดังกล่าว บริษัท จะไม่สามารถให้บริการใด ๆ แก่ผู้ใช้บริการได้ เช่น ความชอบส่วนบุคคล ประวัติการซื้อขาย และการใช้งานระบบ
                        <br>
                        วัตถุประสงค์ในการรวบรวมจัดเก็บ ใช้ ข้อมูลส่วนบุคคล
                        <br>• เพื่อสามารถนำข้อมูลไปดำเนินการเกี่ยวกับการซื้อสินค้าหรือผลิตภัณฑ์ ตามวัตถุประสงค์ ของผู้ใช้บริการ โดยมีการจัดการเกี่ยวกับการให้บริการด้านสินค้าเพื่อให้สอดคล้องกับโปรไฟล์ของผู้ใช้บริการ
                        <br>• เพื่อให้คำแนะนำและข้อเสนอแก่ท่านเกี่ยวกับสินค้า และ/หรือ บริการของบริษัท ที่ท่านอาจ สนใจ รวมไปถึงนำมาให้บริการปรับปรุงสินค้า การดูแลบำรุงรักษาและการจัดการของผลิตภัณฑ์ต่าง ๆ อีกด้วย
                        <br>• ใช้ในการตรวจสอบ และยืนยันตัวตนเมื่อผู้ใช้บริการเข้าใช้บริการต่างๆ ของบริษัท
                        <br>• ใช้ในการวิเคราะห์และจัดทำสถิติต่างๆ เพื่อนำไปพัฒนาบริการและดำเนินการส่งเสริมการ ขายต่างๆ ให้แก่ผู้ให้บริการ
                        <br>• เพื่อดำเนินการสมัครสมาชิก และยืนยันความเป็นสมาชิก รวมไปถึง คุณสมบัติต่าง ๆ ของ สมาชิก ที่ต้องการเข้าร่วมโปรโมชั่นและรางวัลต่าง ๆ
                        <br>• เพื่อนำข้อมูลของผู้ใช้บริการไปดำเนินการเกี่ยวกับรางวัลหรือโบนัสต่าง ๆ
                        <br>• เพื่อติดต่อกับผู้ใช้บริการ และ/หรือ จัดเตรียมอุปกรณ์ส่งเสริมการขายที่เกี่ยวข้องกับ ผลิตภัณฑ์ หรือการให้บริการต่าง ๆ ของบริษัท
                        <br>• อื่น ๆ กล่าวคือ เพื่อการดำเนินการอื่น ๆ ที่จำเป็น ซึ่งเกี่ยวข้องกับวัตถุประสงค์ใด ๆ ข้างต้น
                        
                        
                        
                        <br>
                        
                        <u>การใช้หรือเปิดเผยข้อมูลส่วนบุคคล</u>
                        <br>• การใช้ข้อมูลส่วนบุคคล บริษัทจะใช้ข้อมูลส่วนบุคคลในกรณีที่พิจารณาแล้วเห็นว่าเป็น ประโยชน์ต่อการทำงาน การดำเนินธุรกิจของบริษัท บริษัทจะใช้ข้อมูลส่วนบุคคลให้เป็นไปตามกฎหมายและกฎเกณฑ์ต่างๆ ที่เกี่ยวข้อง หรือเพื่อปรับปรุงบริการให้มีประสิทธิภาพมากขึ้น รวมถึงเพื่อติดต่อผู้ใช้บริการผ่านทางโทรศัพท์ ข้อความ (SMS) อีเมล หรือไปรษณีย์ หรือผ่านช่องทางใดๆ เพื่อสอบถาม หรือแจ้งให้ผู้ใช้บริการทราบ หรือตรวจสอบและยืนยันข้อมูล หรือสำรวจความคิดเห็น หรือแจ้งข้อมูลข่าวสารอื่นใดที่เกี่ยวข้องกับการให้บริการของบริษัทตามที่จำเป็น
                        <br>• การใช้ข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์ทางการตลาด นอกจากวัตถุประสงค์ดังกล่าวข้างต้น และภายใต้ข้อกำหนดของกฎหมาย บริษัท อาจจะใช้ชื่อ-นามสกุล และข้อมูลการติดต่อของผู้ใช้บริการ เพื่อวัตถุประสงค์ทางการตลาด โดยในการดำเนินการดังกล่าวนี้ บริษัท อาจต้องเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้บริการให้แก่บุคลากรและพันธมิตรทางธุรกิจของบริษัท เพื่อการดำเนินการใดๆ เพื่อให้บริษัทบรรลุวัตถุประสงค์นี้
                        <br>• การเปิดเผยข้อมูลส่วนบุคคล บริษัทจะเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้บริการให้แก่บุคคลที่สามเพื่อประโยชน์ในการเพิ่มประสิทธิภาพการให้บริการในด้านต่างๆ แก่ผู้ใช้บริการมากยิ่งขึ้น หรืออำนวยความสะดวกอื่นใดแก่ผู้ใช้บริการได้อย่างถูกต้อง
                        <br>• การโอน ถ่าย และ/หรือส่งข้อมูลส่วนบุคคลของท่านไปยังต่างประเทศ ข้อมูลส่วนบุคคลของ ท่านอาจถูกโอน ถ่าย ถูกจัดเก็บไว้ หรือถูกประมวลผลโดยบริษัท หรืออาจถูกส่งให้แก่บุคคลหรือหน่วยงานใด ๆ ตามรายละเอียดข้างต้น ซึ่งอาจมีที่ตั้งหรืออาจให้บริการอยู่ในประเทศไทยหรือนอกประเทศไทย ทั้งนี้ บริษัท จะกำหนดมาตรฐานในการทำข้อตกลง และ/หรือ สัญญาร่วมธุรกิจกับหน่วยงาน องค์กรที่จะได้รับข้อมูลส่วนบุคคลนั้น ในมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลที่เป็นที่ยอมรับ และสอดคล้องกับกฎหมายที่เกี่ยวข้อง
                        <br>• มีการเปิดเผยข้อมูลส่วนบุคคลและ/หรือใช้ให้แก่สปอนเซอร์ของผู้ใช้บริการ
                        <br> • บุคคลภายนอกซึ่งเป็นผู้ให้บริการ (ซึ่งรวมถึงธนาคาร ฝ่ายกฎหมาย ฝ่ายบัญชี และ บุคคลภายนอกที่เกี่ยวข้องกับการให้บริการด้านการบริหารจัดการ การสื่อสารต่าง ๆ ระบบคอมพิวเตอร์ ผู้ชำระเงิน การพิมพ์ หรือการให้บริการอื่น ๆ เพื่อให้บริษัทสามารถดำเนินธุรกิจได้ รวมไปถึงผู้ตรวจสอบและหน่วยงานราชการต่าง ๆ
                        
                        <br>
                        <u>การเก็บรักษาและระยะเวลาจัดเก็บข้อมูลส่วนบุคคล</u>
                        <br>• บริษัทจะจัดเก็บข้อมูลส่วนบุคคลของผู้ใช้บริการไว้ตามระยะเวลาที่จำเป็นตราบที่ผู้ใช้บริการ ยังเป็นผู้ใช้บริการหรือมีความสัมพันธ์อยู่กับบริษัท หรือตลอดระยะเวลาที่จำเป็นเพื่อให้บรรลุวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้ ซึ่งอาจจำเป็นต้องเก็บรักษาไว้ต่อไปภายหลังจากนั้นหากมีกฎหมายกำหนดหรืออนุญาตไว้ เพื่อวัตถุประสงค์ในการพิสูจน์ตรวจสอบกรณีอาจเกิดข้อพิพาทในอายุความตามที่กฎหมายกำหนดเป็นระยะเวลาไม่เกิน 10 ปี เป็นต้น ทั้งนี้ บริษัทจะลบหรือทำลายข้อมูลส่วนบุคคล หรือทำให้เป็นข้อมูลที่ไม่สามารถระบุถึงตัวตนของผู้ใช้บริการได้เมื่อหมดความจำเป็นหรือสิ้นสุดระยะเวลาดังกล่าว โดยจัดเก็บในรูปแบบเอกสาร และ/หรือข้อมูลอิเล็กทรอนิกส์ และจัดเก็บ ณ สถานที่ที่มีการจำกัดสิทธิการเข้าถึง เช่น เก็บไว้ใน Server หรือเก็บไว้บน Cloud ที่เป็นผู้ให้บริการของบริษัท เป็นต้น
                        
                        <br>
                        <u>สิทธิตามกฎหมายของผู้ใช้บริการ</u>
                        <br>• สิทธิในการขอเข้าถึงและขอรับสำเนาข้อมูลส่วนบุคคลซึ่งอยู่ในความรับผิดชอบของบริษัท ซึ่ง จะมีการกำหนดขั้นตอนที่เหมาะสมเพื่อยืนยันตัวตนจากผู้ใช้บริการ
                        <br>• สิทธิในการขอให้บริษัท ดำเนินการปรับปรุงหรือแก้ไขข้อมูลส่วนบุคคลของผู้ใช้บริการ เพื่อให้ มีความถูกต้อง เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด
                        <br>• สิทธิในการขอให้จำกัด/ระงับการใช้ และ/หรือ การประมวลผลข้อมูลส่วนบุคคลเป็นการ ชั่วคราว
                        <br>• สิทธิในการคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลที่เกี่ยวกับผู้ใช้บริการ รวมถึงสิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล
                        <br>• สิทธิในการขอให้ดำเนินการลบหรือทำลาย หรือทำให้ข้อมูลส่วนบุคคลของผู้ใช้บริการ อยู่ใน รูปแบบที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูลส่วนบุคคลได้
                        <br>• สิทธิในการถอนความยินยอม หรือร้องขอให้เปลี่ยนแปลงขอบเขตความยินยอมของ ผู้ใช้บริการที่เคยให้แก่บริษัท ในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้บริการ ทั้งนี้การถอนความยินยอมจะไม่ส่งผลกระทบต่อการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้บริการที่ได้ให้ความยินยอมไว้แล้ว
                        <br>• สิทธิในการขอทราบความมีอยู่ ลักษณะของข้อมูลส่วนบุคคล และวัตถุประสงค์ของการนำ ข้อมูลส่วนบุคคลไปใช้ของบริษัท และ สิทธิในการขอให้บริษัท ส่งหรือโอนข้อมูลส่วนบุคคลไปยังผู้ใช้บริการ หรือบุคคลหรือองค์กรอื่นตามที่ผู้ใช้บริการกำหนด
                        <br> • สิทธิในการขอให้เปิดเผยถึงการได้มาซึ่งข้อมูลส่วนบุคคลที่เกี่ยวกับผู้ใช้บริการ ในกรณีที่เป็น ข้อมูลซึ่งผู้ใช้บริการไม่ได้ให้ความยินยอมในการรวบรวมหรือจัดเก็บ
                        <br>• บริษัท จะดำเนินการให้แล้วเสร็จภายใน 30 (สามสิบ) วันหลังจากที่ผู้ใช้บริการมีคำขอ ดังกล่าวมาถึงบริษัทหาก ผู้ใช้บริการต้องการที่จะใช้สิทธิดังกล่าวข้างต้น กรุณาติดต่อมายังบริษัท ทางช่องทางของบริษัท
                        <br>• บริษัทอาจเรียกเก็บค่าใช้จ่ายที่สมเหตุสมผล สำหรับการดำเนินการเกี่ยวกับคำขอใช้สิทธิ ข้างต้นเท่าที่กฎหมายและกฎระเบียบที่ใช้บังคับอนุญาต
                        
                        <br>
                        <u>เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล</u>
                        <br>• บริษัท ได้แต่งตั้งเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลเพื่อตรวจสอบการดำเนินการที่เกี่ยวกับ การเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลให้สอดคล้องกับพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 และนโยบาย ระเบียบ ประกาศ คำสั่ง ของบริษัท รวมทั้งประสานงานและให้ความร่วมมือกับสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล โดยเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลดังกล่าวคือ บริษัท เพลินพอดี จำกัด ซึ่งมีรายละเอียดและช่องทางการติดต่อในช่องทางการติดต่อของบริษัท
                        <br>
                        <u>ช่องทางการติดต่อบริษัท</u>
                        <br>หากผู้ใช้บริการมีคำถามหรือข้อสงสัย เกี่ยวกับนโยบายความเป็นส่วนตัวนี้ หรือการจัดการดูแลข้อมูล ของผู้ใช้บริการ หรือต้องการจะใช้สิทธิต่างๆของผู้ใช้บริการตาม พรบ.คุ้มครองข้อมูลส่วนบุคคล ผู้ใช้บริการสามารถติดต่อหรือแสดงเจตนามายังช่องทางดังนี้
                        <br> - ศูนย์บริการลูกค้าที่เบอร์ 02-066-9981
                        <br>- E-mail: moldiiapp@gmail.com
                        <br>- หรือส่งหนังสือทางไปรษณีย์ : โดยจัดส่งมายัง บริษัท เพลินพอดีจำกัด เลขที่ 288/290 ถนนสุขาภิบาล 5 แขวงออเงิน เขตสายไหม กรุงเทพฯ 10220
                        <br>ระบุผู้รับเป็น "Data Protection Team เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล"
                        
                        <br><br>แก้ไขล่าสุด พฤษภาคม 2565
                </p>
            </div>
            <div class="modal-footer">
              <button type="button" class="btn btn-secondary" data-dismiss="modal">ปิด</button>
             
            </div>
          </div>
        </div>
      </div>


{{-- เบอร์โทรศัพท์นี้ได้ทำการใช้งานไปเรียบร้อยแล้วค่ะ --}}
@endsection
@section('custom_script')
    <script>
        var a = "{{Session::get('success')}}";
        if(a){
            Swal.fire({
            text : a,
            confirmButtonColor: "#fc684b",
        })
        }

        var cn =0 ;
        var cm =0 ;

        
        function checkusername(v){
           
            $.ajax({
                url: '{{ url("checkusername")}}',
                type: 'GET',
                dataType: 'HTML',
                data: {'name':v},
                success: function(data) {
                    if(data == 1){
                        cn = 1;
                        Swal.fire({
                            text : "มีชื่อบัญชีนี้ในระบบแล้ว กรุณากรอกใหม่",
                            confirmButtonColor: "#fc684b",
                        })
                        
                        document.getElementById("username").value = '';
                        $('#username').focus();
                    }else{
                       
                        cn = 0;

                    }
                }
            });
        }

        function checkmn(v){
            // console.log(v);
            $.ajax({
                url: '{{ url("checkmn")}}',
                type: 'GET',
                dataType: 'HTML',
                data: {'mn':v},
                success: function(data) {
                    if(data == 1){
                        cm = 1;
                        Swal.fire({
                            text : "มีเบอร์โทรศัพท์นี้ในระบบแล้ว กรุณากรอกใหม่",
                            confirmButtonColor: "#fc684b",
                        })

                        document.getElementById("mn").value = '';
                        $('#mn').focus();
                    }else{
                        cm = 0;
                        

                    }
                }
            });
        }



        function subform(){
            // console.log(cn);
            // console.log(cm);
            var f =  document.getElementById("firstname").value;
            var l =  document.getElementById("lastname").value;
            var p =  document.getElementById("password").value;
            var x = $("#chk").is(":checked");
            console.log(x);
          
            if(cn ==0 && cm ==0 && f !='' && l !='' && p !=''){
                if(x !=false){
                    $('#formregis').submit();

                }else{
                    Swal.fire({
                        text : "กรุณายอมรับเงื่อนไขการให้บริการของ Moldii",
                        confirmButtonColor: "#fc684b",
                    })


                }
               
            }else{
                Swal.fire({
                    text : "กรุณาข้อมูลให้ครบถ้วน",
                    confirmButtonColor: "#fc684b",
                })
            }
        }

   
    </script>
@endsection
