@extends('mobile.main_layout.main')
@section('app_header')
<div class="appHeader bg-danger text-light">
    <div class="left">
        <ion-icon name="arrow-back-outline" onclick="window.history.back();"></ion-icon>
    </div>
    <div class="pageTitle">
        กฏระเบียบในการใช้
    </div>
</div>
@endsection
@section('content')
<br>
    <div class="col-12 m-0 p-2">
        กฎระเบียบในการใช้ถูกตั้งขึ้น เนื่องจากเราต้องการสร้าง Moldii App ให้เป็นประสบการณ์ของตนเอง เชื่อมต่อกับเพื่อน รวมถึงสร้างชุมชน และสังคมที่เป็นมิตร ที่ช่วยเหลือเกื้อกูลกัน อีกทั้งเพื่อให้ผู้ใช้มีประสบการณ์การซื้อขายที่ปลอดภัย เราอยากให้คุณอ่านสิ่งที่ควร และไม่ควรทำ เราตระหนักดีว่า Moldii App ควรเป็นพื้นที่ที่ผู้คนรู้สึกมั่นใจที่จะสื่อสาร หรือการซื้อขาย และเราทำตามบทบาทของเราอย่างจริงจังในการป้องกันไม่ให้มีการใช้งานที่ไม่เหมาะสมบนบริการของเรา เราจึงได้พัฒนามาตรฐานสำหรับสิ่งที่ได้รับอนุญาตและไม่ได้รับอนุญาตให้ทำบน Moldii App เมื่อคุณทำการซื้อขายบนตลาดออนไลน์โมเดลแห่งนี้ ในการใช้ Moldii App เราถือว่าคุณได้ตกลงยอมรับเงื่อนไขการให้บริการที่นี่ พวกเรามุ่งมั่นที่จะรักษาสังคมการใช้งานให้มีความปลอดภัย
    </div>


@endsection

@section('custom_script')
<script>
    bottom_now(7);
</script>
@endsection