@extends('mobile.main_layout.main')
@section('app_header')
<div class="appHeader bg-danger text-light">
    <div class="left">
        <ion-icon name="arrow-back-outline" onclick="window.history.back();"></ion-icon>
    </div>
    <div class="pageTitle">
        หน้าขอเปิดร้านค้า
    </div>
</div>
@endsection
@section('content')
<br>
<div class="mt-3 p-2 col-md-12">

    <form action="{{url('user/submitstore')}}" method="POST" enctype="multipart/form-data">
        @csrf
        
        <input type="text" name="fname" placeholder="ชื่อเจ้าของร้านค้า" class="form-control" required><br>
        <input type="text" name="lname" placeholder="นามสกุลเจ้าของร้านค้า" class="form-control" required><br>
        <input type="text" name="phone" placeholder="หมายเลขโทรศัพท์" class="form-control" onkeyup="autoTab(this);" required><br>
        <input type="email" name="email" placeholder="อีเมล" class="form-control" required><br>
        <input type="text" name="shopname" placeholder="ชื่อร้านค้าที่ต้องการเปิด" class="form-control" required><br>
        <input type="text" name="type" placeholder="ประเภทสินค้าที่ต้องการขาย" class="form-control" required><br>
        <input type="text" name="address" placeholder="รายละเอียดที่อยู่" class="form-control" required><br>
    
        <select  class="form-control" name="province" id="province" onchange="getAmphure(this.value);" required>
            
                <option value="" >เลือกจังหวัด</option>
                @foreach($p as  $ps)
                    <option value="{{$ps->id}}" >{{$ps->name_th}}</option>
                @endforeach
            
        </select><br>
    
        <select  class="form-control" name="district" id="county" onchange="getSubDistrict(this.value);" required>
            <option>เลือกเขต/อำเภอ</option>
        </select><br>
        <select  class="form-control" name="tumbon" id="tumbon" onchange="getZipcode(this.value);" required>
            <option>เลือกแขวง/ตำบล</option>
        </select><br>

        <input  type="text" name="zip_code" class="form-control" placeholder="รหัสไปรษณีย์" id="zip_code" readonly>

        <br>

        แนบสลิป :  <input accept="image/*" type='file' id="imgInp" name="img" accept="image/*;capture=camera" required> 
        <center><br><img id="blah" src="#" alt="" width ="80%"></center>

        <br>
        <input type="checkbox" name="" id="" checked><u data-toggle="modal" data-target="#condition" >เงือนไขการเปิดร้านค้า</u>
        <button type="submit" class="btn btn-success col-12 mt-4" style="font-size:1.3rem;">ยันยันการขอเปิดร้านค้า</button>
        {{-- <a href="#"><button type="button" class="btn btn-danger col-12 mt-2" style="font-size:1.3rem;">ยกเลิก</button></a> <!-- ให้ลิงค์กลับมาหน้าเดิม คล้ายการทำ  Reset --> --}}
    </form>

</div>


<div class="modal" tabindex="-1" role="dialog" id="condition">
    <div class="modal-dialog modal-dialog-centered"  role="document">
      <div class="modal-content">
        <div class="modal-header">
          <h5 class="modal-title">เงือนไขการเปิดร้านค้า</h5>
          <button type="button" class="close" data-dismiss="modal" aria-label="Close">
            <span aria-hidden="true">&times;</span>
          </button>
        </div>
        <div class="modal-body">
          <p>เงื่อนไขการสมัครร้านค้าของ Moldii<br>
            <u>1. บทนำ</u><br>
            1.1 โปรดอ่านเงื่อนไขการให้บริการต่อไปนี้อย่างละเอียดก่อนใช้ไซต์นี้หรือเปิดบัญชี Modii Shop (“บัญชี”) เพื่อที่คุณจะได้ทราบถึงสิทธิและข้อผูกพันตามกฎหมายของคุณอันเกี่ยวเนื่องกับ  “บริการ” ที่เราจัดไว้ให้หรือทำให้ใช้งานได้รวมถึง 
            <br>(ก) ไซต์ <br>(ข) บริการที่จัดไว้ให้โดยไซต์และโดยซอฟต์แวร์ไคลเอ็นต์ Modii Shop ที่ทำให้ใช้งานได้ผ่านทางไซต์ และ <br>(ค) ข้อมูลข่าวสารทั้งหมด หน้าที่เชื่อมโยง คุณสมบัติ ข้อมูล ข้อความสั้นๆ รูปภาพ ภาพถ่าย กราฟิก เพลง เสียง วิดีโอ (รวมถึงการทำ live stream) ข้อความ แท็ก เนื้อหา โปรแกรม ซอฟต์แวร์ บริการแอปพลิเคชัน (รวมถึงโดยไม่จำกัดเพียงบริการแอปพลิเคชันบนมือถือใดๆ) หรือวัสดุอื่นๆ ที่ทำให้ใช้งานได้ผ่านทางไซต์หรือบริการที่เกี่ยวข้องกับไซต์ ("เนื้อหา")  คุณสมบัติใหม่ใด ๆ ที่เพิ่มไปยังหรือเสริมให้กับบริการจะอยู่ภายใต้เงื่อนไขการให้บริการนี้ด้วยเช่นกัน เงื่อนไขการให้บริการนี้จะควบคุมการใช้บริการของคุณซึ่งจัดไว้ให้โดยModii Shop
            <br>1.2 บริการที่รวมบริการแพลตฟอร์มออนไลน์ซึ่งจัดหาสถานที่และโอกาส เพื่อการขายสินค้าระหว่างผู้ซื้อ (“ผู้ซื้อ”) และผู้ขาย (“ผู้ขาย”) (เรียกรวมว่า “คุณ” “ผู้ใช้” หรือ “คู่ให้สิทธิให้”) สัญญาขายที่แท้จริงเป็นสัญญาระหว่างผู้ซื้อและผู้ขายโดยตรง และ Modii Shop ไม่ได้เป็นคู่สัญญาของสัญญาฉบับนั้นหรือสัญญาอื่นใดระหว่างผู้ซื้อและผู้ขาย และจะไม่ยอมรับข้อผูกพันใดๆ ที่เกี่ยวเนื่องกับสัญญาดังกล่าว คู่สัญญาของธุรกรรมดังกล่าวจะรับผิดชอบต่อสัญญาขายระหว่างคู่สัญญาทั้งหมด บัญชีรายชื่อสินค้า การรับประกันการซื้อและสิ่งอื่นที่คล้ายกัน Modii Shop ไม่มีส่วนเกี่ยวข้องในธุรกรรมระหว่างผู้ใช้ Modii Shop ไม่ทำการคัดกรองล่วงหน้าต่อผู้ใช้ หรือเนื้อหาหรือข้อมูลที่จัดไว้ให้โดยผู้ใช้ Modii Shop ไม่สามารถรับประกันว่าผู้ใช้จะทำธุรกรรมเสร็จสิ้นจริงๆ
            <br>1.3 ก่อนที่จะเป็นสมาชิกของ Modii Shop คุณจะต้องอ่านและยอมรับข้อกำหนด นโยบาย และเงื่อนไขทั้งหมดใน และที่เชื่อมโยงกับ เงื่อนไขการให้บริการนี้และคุณจะต้องยินยอมรับการดำเนินการข้อมูลส่วนบุคคลของคุณดังที่อธิบายไว้ในนโยบายความเป็นส่วนตัว
            <br>1.4 Modii Shop ขอสงวนสิทธิ์ในการเปลี่ยนแปลง ดัดแปลง ระงับ หรือยกเลิกไซต์นี้หรือบริการทั้งหมด หรือระงับการขาย หรือบางส่วนได้ตลอดเวลา Modii Shop อาจมีการออกบริการบางอย่างหรือคุณสมบัติของบริการในรุ่นเบต้า ซึ่งอาจไม่ทำงานอย่างถูกต้อง หรือในลักษณะเดียวกันกับที่รุ่นสุดท้ายอาจทำงาน และเราจะไม่รับผิดในสถานการณ์ดังกล่าว Modii Shop ยังอาจกำหนดขอบเขตสำหรับคุณสมบัติบางอย่าง หรือจำกัดการเข้าถึงบางส่วนหรือทั้งหมดของไซต์หรือบริการโดยใช้ดุลยพินิจของตัวเองแต่เพียงผู้เดียวและโดยไม่ต้องแจ้งหรือรับผิด
            <br>1.5 Modii Shop ขอสงวนสิทธิ์ในการปฏิเสธที่จะให้คุณเข้าถึงไซต์หรือบริการ หรือปฏิเสธที่จะอนุญาตให้คุณเปิดบัญชีไม่ว่าด้วยเหตุผลใดก็ตามโดยการใช้บริการหรือเปิดบัญชี Modii Shop คุณได้ให้การยอมรับและความยินยอมที่เพิกถอนไม่ได้ต่อข้อตกลงนี้รวมถึงข้อกำหนดเงื่อนไขและนโยบายเพิ่มเติม
            หากคุณไม่เห็นด้วยกับข้อตกลงนี้ โปรดงดใช้บริการหรือเข้าถึงไซต์ หรืองดสมัครสมาชิก หากคุณอายุต่ำกว่า 18 ปีหรือยังไม่บรรลุนิติภาวะ (“นิติภาวะ”) คุณจะต้องขออนุญาตจากพ่อแม่หรือผู้ปกครองตามกฎหมายเพื่อเปิดบัญชี และพ่อแม่หรือผู้ปกครองตามกฎหมายดังกล่าวต้องเห็นด้วยกับข้อกำหนดของข้อตกลงนี้ หากคุณไม่ทราบว่าคุณบรรลุนิติภาวะแล้วหรือยัง หรือไม่เข้าใจความในข้อนี้ โปรดอย่าสร้างบัญชีจนกว่าจะได้ขอความช่วยเหลือจากพ่อแม่หรือผู้ปกครองตามกฎหมายแล้ว หากคุณคือพ่อแม่หรือผู้ปกครองตามกฎหมายของผู้เยาว์ที่กำลังสร้างบัญชี คุณจะต้องยอมรับข้อกำหนดของข้อตกลงนี้แทนผู้เยาว์และคุณจะต้องรับผิดชอบต่อการใช้งานบัญชีหรือบริการของบริษัททั้งหมดจากการใช้บัญชีดังกล่าว ไม่ว่าบัญชีดังกล่าวจะเปิดอยู่แล้วในขณะนี้หรือสร้างในภายหลังก็ตาม
            
            <br><u>2.ความเป็นส่วนตัว</u>
            <br>2.1 ความเป็นส่วนตัวของคุณมีความสำคัญมากสำหรับ Modii Shop เพื่อให้คุ้มครองสิทธิของคุณได้ดีขึ้น เราจึงได้จัดทำนโยบายความเป็นส่วนตัวของ Modii Shop เพื่ออธิบายแนวทางปฏิบัติด้านความเป็นส่วนตัวในรายละเอียด โปรดอ่านนโยบายความเป็นส่วนตัวนี้เพื่อให้เข้าใจว่า Modii Shop เก็บรวบรวมและใช้ข้อมูลที่เกี่ยวกับบัญชีของคุณและ/หรือการใช้งานบริการของคุณอย่างไร(“ข้อมูลของผู้ใช้”)โดยการใช้บริการหรือให้ข้อมูลทางไซต์คุณ:
            <br>(ก) ยินยอมให้ Modii Shop เก็บรวบรวม ใช้งาน เปิดเผย และ/หรือดำเนินการกับเนื้อหา ข้อมูลส่วนบุคคลของคุณและข้อมูลของผู้ใช้ตามที่อธิบายไว้ในนโยบายความเป็นส่วนตัว
            <br>(ข)ตกลงและยอมรับว่าสิทธิการเป็นเจ้าของในข้อมูลของผู้ใช้เป็นของModii Shopและของคุณร่วมกัน
            <br>(ค) จะไม่เปิดเผยข้อมูลของผู้ใช้ต่อบุคคลภายนอก ไม่ว่าทั้งหมดหรือบางส่วน หรือยินยอมให้บุคคลภายนอกสามารถเข้าถึงหรือใช้ข้อมูลของผู้ใช้ของท่านโดยไม่ได้รับความยินยอมจากModii Shopเป็นลายลักษณ์อักษรก่อน
            <br>2.2 ผู้ใช้ที่ครอบครองข้อมูลส่วนบุคคลของผู้ใช้คนอื่นผ่านการใช้บริการ (“ฝ่ายผู้รับ”) ตกลงว่าจะ <br>(1) ปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลที่บังคับใช้ทั้งหมดอันเกี่ยวกับข้อมูลดังกล่าว <br>(2) อนุญาตให้ผู้ใช้ ซึ่งฝ่ายผู้รับได้เก็บรวบรวมข้อมูลส่วนบุคคลไว้ (“ฝ่ายผู้เปิดเผย”) ลบข้อมูลของตนที่เก็บรวบรวมไว้ออกจากฐานข้อมูลของฝ่ายผู้รับ และ <br>(3) อนุญาตให้ฝ่ายผู้เปิดเผยตรวจสอบว่าฝ่ายผู้รับมีการเก็บรวบรวมข้อมูลใดบ้างเกี่ยวกับตน ในแต่ละกรณีของข้อ (2) และข้อ (3) ข้างต้น ตามและเมื่อกฎหมายที่บังคับใช้กำหนดไว้
            <br><u>3.สิทธิ์การใช้งานแบบจำกัด</u>
            <br> 3.1 Modii Shop มอบสิทธิ์การใช้งานแบบจำกัดและเพิกถอนได้ในการเข้าถึงและใช้บริการตามข้อกำหนด และเงื่อนไขของเงื่อนไขการให้บริการนี้ เนื้อหา เครื่องหมายการค้า เครื่องหมายบริการ ชื่อตราสินค้า โลโก้ และทรัพย์สินทางปัญญาอื่นๆ ที่มีกรรมสิทธิ์ทั้งหมด (“ทรัพย์สินทางปัญญา”) ที่แสดงในไซต์ เป็นทรัพย์สินของ Modii Shop และหากเหมาะสม เป็นทรัพย์สินของบุคคลภายนอกที่ถือกรรมสิทธิ์ตามที่ระบุไว้ในไซต์ ไม่มีการมอบสิทธิหรือสิทธิ์การใช้งานทั้งโดยตรงหรือโดยอ้อมแก่บุคคลใดที่เข้าถึงไซต์เพื่อใช้งานหรือลอกเลียนแบบทรัพย์สินทางปัญญาใด และไม่มีบุคคลใดที่เข้าถึงไซต์จะสามารถอ้างสิทธิ กรรมสิทธิ์ หรือผลประโยชน์ในไซต์นี้ได้ โดยการใช้หรือเข้าถึงบริการ คุณตกลงที่จะปฏิบัติตามกฎหมายลิขสิทธิ์ เครื่องหมายการค้า เครื่องหมายบริการ และกฎหมายที่บังคับใช้อื่นๆ ทั้งหมด ที่คุ้มครองบริการ ไซต์ และเนื้อหาในไซต์ คุณตกลงที่จะไม่คัดลอก แจกจ่าย เผยแพร่ต่อ ส่งต่อ แสดงแก่สาธารณะ ดำเนินการต่อสาธารณะ ดัดแปลง ปรับเปลี่ยน ให้เช่า ขาย หรือสร้างงานอนุพันธ์จากส่วนหนึ่งส่วนใดของบริการ ไซต์ หรือเนื้อหาในไซต์ คุณยังจะต้องไม่สะท้อนหรือตีกรอบส่วนหนึ่งส่วนใดหรือทั้งหมดของเนื้อหาในไซต์นี้บนเซิร์ฟเวอร์อื่นใด หรือเป็นส่วนหนึ่งของเว็บไซต์อื่น โดยไม่ได้รับคำยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากเรา นอกจากนี้ คุณตกลงว่าจะไม่ใช้โรบอต สไปเดอร์ หรืออุปกรณ์อัตโนมัติอื่นใด หรือกระบวนการที่ทำด้วยมือเพื่อเฝ้าติดตามหรือคัดลอกเนื้อหาของเรา โดยไม่ได้รับคำยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากเรา (คำยินยอมดังกล่าวจะถือว่ามอบให้สำหรับเทคโนโลยีเครื่องมือค้นหามาตรฐานที่ใช้โดยเว็บไซต์ค้นหาทางอินเทอร์เน็ตเพื่อนำผู้ใช้อินเทอร์เน็ตมายังเว็บไซต์นี้)
            <br>3.2 คุณสามารถเชื่อมโยงไปยังไซต์จากเว็บไซต์ของคุณ โดยมีข้อแม้ว่าเว็บไซต์ของคุณไม่ได้แสดงนัยของการรับรองโดยหรือเชื่อมโยงกับ Modii Shop คุณรับทราบว่า Modii Shop อาจยกเลิกการให้บริการไม่ว่าทั้งหมดหรือบางส่วนได้ตลอดเวลา ตามดุลยพินิจแต่เพียงผู้เดียวของตนโดยไม่ต้องแจ้งให้ทราบ
            <br>4.ซอฟต์แวร์ที่เราจัดไว้ให้คุณเป็นส่วนหนึ่งของบริการนี้ อยู่ภายใต้ข้อกำหนดของเงื่อนไขการให้บริการนี้ Modii Shop สงวนสิทธิ์ทั้งหมดต่อซอฟต์แวร์ที่ไม่ได้อนุญาตไว้อย่างชัดแจ้งโดย Modii Shop ในที่นี้ สคริปต์หรือรหัสของบุคคลภายนอก ที่เชื่อมโยงไปยังหรืออ้างถึงจากบริการ บุคคลภายนอกที่เป็นเจ้าของสคริปต์หรือรหัสดังกล่าวเป็นผู้มอบสิทธิ์การใช้งานให้แก่คุณ ไม่ใช่มอบให้โดยModii Shop
            <br><u>5.บัญชีและความปลอดภัย</u>
            <br>5.1 การทำงานบางอย่างของบริการของเราต้องมีการลงทะเบียนบัญชีโดยเลือกรหัสประจำตัวผู้ใช้ที่ไม่ซ้ำกัน ("ID ผู้ใช้") และรหัสผ่าน และโดยการให้ข้อมูลส่วนบุคคลบางอย่าง หากคุณเลือก ID ผู้ใช้ ที่ตามดุลยพินิจแต่เพียงผู้เดียวของ Modii Shop เห็นว่า สร้างความขุ่นเคืองหรือไม่เหมาะสม Modii Shop มีสิทธิที่จะระงับหรือยกเลิกบัญชีของคุณได้ คุณอาจสามารถใช้บัญชีเพื่อเข้าถึงผลิตภัณฑ์ เว็บไซต์ หรือบริการอื่นๆ ซึ่งเราอนุญาตให้เข้าถึงได้ หรือที่เชื่อมโยงกันหรือทำงานร่วมกัน Modii Shop ไม่ได้ตรวจสอบ และไม่รับผิดชอบต่อเนื้อหาของบุคคลภายนอก ฟังก์ชั่นการทำงาน ความปลอดภัย บริการ นโยบายความเป็นส่วนตัว หรือการปฏิบัติอื่นๆ ของผลิตภัณฑ์ เว็บไซต์ หรือบริการเหล่านั้น หากคุณกระทำการดังกล่าว เงื่อนไขการให้บริการของผลิตภัณฑ์ เว็บไซต์ หรือบริการเหล่านั้น รวมถึงนโยบายความเป็นส่วนตัวที่เกี่ยวข้อง หากแตกต่างจากเงื่อนไขการให้บริการและ/หรือนโยบายความเป็นส่วนตัวของเรา อาจบังคับใช้กับการใช้ผลิตภัณฑ์ เว็บไซต์ หรือบริการเหล่านั้นของคุณ
            <br>5.2 คุณตกลงที่จะ <br>(ก) เก็บรักษารหัสผ่านไว้เป็นความลับและใช้เฉพาะ ID ผู้ใช้และรหัสผ่านของคุณเมื่อเข้าสู่ระบบ <br>(ข) ตรวจสอบให้แน่ใจว่าคุณออกจากระบบบัญชีเมื่อสิ้นสุดแต่ละเซสชันบนไซต์ <br>(ค) แจ้ง Modii Shop ทันทีหากมีการใช้บัญชี ID ผู้ใช้ และ/หรือรหัสผ่านของคุณโดยไม่ได้รับอนุญาต <br>(ง) ตรวจสอบให้แน่ใจว่าข้อมูลบัญชีของคุณถูกต้องและเป็นปัจจุบันอยู่เสมอ คุณต้องรับผิดชอบอย่างเต็มที่ต่อกิจกรรมทั้งหมดที่เกิดขึ้นภายใต้ ID ผู้ใช้และบัญชีของคุณ แม้ว่าคุณจะไม่ได้ทำกิจกรรมหรือทำการใช้งานดังกล่าวก็ตาม Modii Shop จะไม่รับผิดต่อความสูญเสียหรือความเสียหายที่เกิดจากการใช้รหัสผ่านของคุณโดยไม่ได้อนุญาตหรือการที่คุณไม่สามารถปฏิบัติตามความในส่วนนี้
            <br>5.3 คุณตกลงว่า Modii Shop สามารถยกเลิกการเป็นสมาชิก หรือ การเปิดร้านค้าของคุณไม่ว่าด้วยเหตุผลใดและตามดุลยพินิจแต่เพียงผู้เดียวของตน และโดยไม่ต้องแจ้งหรือรับผิดต่อคุณหรือบุคคลภายนอกใดๆ สามารถยกเลิกบัญชีและ ID ผู้ใช้ของคุณได้ทันที และลบหรือเพิกถอนเนื้อหาใดก็ตามที่เกี่ยวข้องกับบัญชีหรือ ID ผู้ใช้ของคุณออกจากไซต์ หรือในกรณีที่ร้ายแรงกว่านั้นอาจระงับการขายหรือการคืนเงินใดๆอย่างถาวรและ/หรือใช้มาตราการอื่นใดที่ Modii Shop เห็นสมควร มูลเหตุสำหรับการยกเลิกดังกล่าวอาจได้แก่ แต่ไม่จำกัดเพียง <br>(ก) การไม่มีการใช้งานเป็นเวลานานๆ <br>(ข) การละเมิดเจตนารมณ์หรือตัวอักษรของเงื่อนไขการให้บริการนี้ <br>(ค) พฤติกรรมผิดกฎหมาย ฉ้อฉล ล่วงละเมิด ทำให้เสื่อมเสีย คุกคาม หรือขู่เข็ญ <br>(ง) การมีบัญชีผู้ใช้หลายบัญชี <br>(จ) การซื้อสินค้าจากไซต์โดยมีวัตถุประสงค์เพื่อการจำหน่ายต่อ <br>(ฉ) การซื้อสินค้าจากผู้ขายรายเดียวหรือกลุ่มผู้ขายเดียวกันในลักษณะที่ผิดปกติวิสัยหรือในปริมาณที่มากเกินปกติ <br>(ช) การใช้ voucher ส่วนลดในทางที่ผิด (รวมถึง แต่ไม่จำกัดซึ่ง การจำหน่ายvoucherส่วนลดให้แก่บุคคลอื่น หรือการจำหน่าย voucherส่วนลด หรือเครดิต(credit)โดยการเพิ่มราคาให้สูงกว่ามูลค่าที่เป็นจริง หรือการใช้voucherส่วนลดในลักษณะที่ผิดปกติวิสัยหรือในปริมาณที่มากเกินปกติบนไซต์ หรือ(ซ) พฤติกรรมที่เป็นอันตรายต่อผู้ใช้คนอื่น บุคคลภายนอก หรือผลประโยชน์ทางธุรกิจของ Modii Shop การใช้บัญชีเพื่อจุดประสงค์ที่ผิดกฎหมาย ฉ้อฉล ล่วงละเมิด ทำให้เสื่อมเสีย คุกคาม หรือขู่เข็ญ อาจมีการแจ้งให้หน่วยงานบังคับใช้กฎหมายทราบโดยไม่ต้องแจ้งแก่คุณ หากเกิดข้อพิพาททางกฎหมายหรือการดำเนินคดีเกี่ยวกับบัญชีหรือการใช้บริการของคุณ ไม่ว่าด้วยเหตุผลใดก็ตาม Modii Shop อาจยกเลิกบัญชีของคุณทันทีโดยไม่แจ้งให้ทราบ
            
            <br><u>6.เงื่อนไขการใช้งาน</u>
            <br> 6.1 สิทธิ์การใช้งานไซต์นี้และบริการมีผลจนกว่าจะมีการยกเลิก สิทธิ์การใช้งานนี้จะยกเลิกตามที่ระบุไว้ในเงื่อนไขการให้บริการ หรือเมื่อคุณไม่ปฏิบัติตามข้อกำหนดหรือเงื่อนไขใดๆ ของเงื่อนไขการให้บริการนี้ ในกรณีดังกล่าวไม่จำเป็นต้องแจ้งแก่Modii Shopเพื่อให้การยกเลิกดังกล่าวมีผล
            <br>6.2คุณตกลงที่จะไม่:
            <br>(ก) อัปโหลด โพสต์ ส่งต่อ หรือแสดงเนื้อหาในลักษณะที่ผิดกฎหมาย เป็นภัย คุกคาม ขู่เข็ญ ล่วงละเมิด ทำให้ตื่นตกใจ ทำให้เป็นทุกข์ หลอกลวง ทำให้เสื่อมเสีย หยาบคาย ลามก หมิ่นประมาท ละเอียดอ่อนทางการเมือง ล่วงล้ำความเป็นส่วนตัวของผู้อื่นน่ารังเกียจเหยียดเชื้อชาติหรือชาติพันธุ์ 
            <br>(ข) ละเมิดกฎหมายซึ่งรวมถึงแต่ไม่จำกัดเฉพาะกฎหมายและข้อบังคับที่เกี่ยวกับข้อจำกัดการส่งออกและการนำเข้าสิทธิของบุคคลภายนอกหรือนโยบายสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัดของเรา
            <br>(ค) อัปโหลด โพสต์ ส่งต่อหรือกระทำเนื้อหาใดๆ ที่ส่วนเกี่ยวข้องกับการใช้ผู้เยาว์ที่ไม่ได้อยู่ภายใต้การดูแลของผู้ปกครองหรือใช้บริการเพื่อทำอันตรายต่อผู้เยาว์ไม่ว่าในทางใดก็ตาม
            <br>(ง) ใช้บริการหรืออัปโหลดเนื้อหาเพื่อปลอมแปลงเป็นบุคคลหรือนิติบุคคลอื่น หรือแสดงข้อมูลเท็จเกี่ยวกับความเชื่อมโยงกับบุคคลหรือนิติบุคคลใด
            <br>(จ) ปลอมแปลงส่วนหัวหรือปรับเปลี่ยนรหัสประจำตัวเพื่อปิดบังแหล่งกำหนดของเนื้อหาที่ส่งต่อผ่านบริการ
            <br>(ฉ)ลบประกาศเกี่ยวกับกรรมสิทธิ์ออกจากไซต์
            <br>(ช) เป็นต้นเหตุ อนุญาตหรือมอบอำนาจให้ทำการดัดแปลง สร้างงานอนุพันธ์ หรือแปลบริการโดยไม่ได้รับอนุญาตอย่างชัดแจ้งจากModii Shop
            <br>(ซ) ใช้บริการเพื่อประโยชน์ของบุคคลภายนอกหรือในลักษณะที่ไม่ได้รับอนุญาตตามสิทธิ์การใช้งานที่ให้ไว้ในที่นี้
            <br>(ฌ) ใช้บริการหรืออัปโหลดเนื้อหาในลักษณะที่ไม่เหมาะสม เป็นการฉ้อฉล ผิดจรรยาบรรณ ไม่เป็นความจริง ชี้นำไปในทางที่ผิดหรือเป็นการหลอกลวง
            <br>(ญ) เปิดใช้หรือมีบัญชีผู้ใช้หลายบัญชีเพื่อกระทำการใดๆ ที่เป็นการละเมิดข้อกำหนดหรือวัตถุประสงค์ของข้อกำหนดเงื่อนไขการให้บริการนี้
            <br>(ฎ) เข้าถึงแพลตฟอร์มของ Modii Shop เปิดบัญชีผู้ใช้หรือเข้าถึงบัญชีผู้ใช้ของคุณโดยใช้ ฮาร์ดแวร์ ชุดคำสั่ง หรือโปรแกรมที่ไม่เป็นทางการของช้อปปี้ ซึ่งไม่จำกัดเฉพาะ โปรแกรมเลียนแบบ (emulator) โปรแกรมจำลอง (simulator)บอท(bot)หรือซอฟแวร์หรือฮาร์ดแวร์อื่นใด
            <br>(ฏ)ปรับเปลี่ยนราคาของสินค้าหรือแทรกแซงบัญชีรายชื่อสินค้าของผู้ใช้รายอื่น
            <br>(ฐ)ดำเนินการใดๆที่อาจบ่อนทำลายระบบให้ข้อคิดเห็นหรือระบบการให้คะแนน
            <br>(ฑ) พยายามแยกส่วนแฟ้ม ทำวิศวกรรมย้อนกลับ ถอดประกอบหรือเจาะระบบบริการ (หรือส่วนหนึ่งส่วนใดของบริการ) หรือเอาชนะหรือทำลายเทคโนโลยีการเข้ารหัสหรือมาตรการความปลอดภัยที่ Modii Shop นำมาใช้กับบริการและ/หรือข้อมูลที่ส่งต่อดำเนินการหรือจัดเก็บไว้โดยModii Shop
            <br>(ฒ) เก็บเกี่ยวหรือเก็บรวบรวมข้อมูลเกี่ยวกับเจ้าของบัญชีคนอื่น รวมถึง โดยไม่จำกัดเพียงข้อมูลส่วนบุคคลใดๆ
            <br>(ณ) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้เนื้อหาที่คุณไม่มีสิทธิ์ทำให้ใช้งานได้ภายใต้กฎหมายหรือภายใต้ความสัมพันธ์ตามสัญญาหรือการมอบอำนาจ (เช่น ข้อมูลภายใน ข้อมูลที่เป็นกรรมสิทธิ์และข้อมูลลับที่ได้ทราบหรือถูกเปิดเผยจากความสัมพันธ์ในการจ้างงานหรือภายใต้ข้อตกลงไม่เปิดเผยข้อมูล)ใช้งานได้
            <br>(ด) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้เนื้อหาที่ละเมิดสิทธิบัตร เครื่องหมายการค้า ความลับทางการค้า ลิขสิทธิ์หรือกรรมสิทธิ์อื่นๆของบุคคลอื่นใช้งานได้
            <br>(ต) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้โฆษณาที่ไม่ได้ร้องขอหรือได้รับอนุญาต สื่อประชาสัมพันธ์ “เมลขยะ” “สแปม” “จดหมายลูกโซ่” “ธุรกิจแบบพีระมิด” หรือรูปแบบการเชิญชวนอื่นใดที่ไม่ได้รับอนุญาต ใช้งานได้
            <br>(ถ) อัปโหลด อีเมล โพสต์ ส่งต่อ หรือทำให้วัสดุอื่นๆ ที่มีไวรัสซอฟต์แวร์ หนอน ม้าโทรจัน หรือรหัสคอมพิวเตอร์ รูทีน ไฟล์หรือโปรแกรมที่ออกแบบมาเพื่อแทรกแซงทั้งโดยตรงและโดยอ้อมต่อ ปรับเปลี่ยน ขัดขวาง ทำลาย หรือจำกัดฟังก์ชั่นการทำงานของซอฟต์แวร์คอมพิวเตอร์หรือฮาร์ดแวร์ใดๆ หรือข้อมูลหรืออุปกรณ์โทรคมนาคมใช้งานได้
            <br>(ท) ทำให้กระบวนการไหลปกติของบทสนทนาหยุดชะงัก ทำให้หน้าจอ “เลื่อน” เร็วกว่าที่ผู้ใช้บริการคนอื่นๆ จะสามารถพิมพ์ได้ หรือกระทำการในลักษณะที่ส่งผลเชิงลบต่อความสามารถของผู้ใช้คนอื่นในการเข้าร่วมการแลกเปลี่ยนตามเวลาจริง
            <br>(ธ) แทรกแซง ปรับเปลี่ยน หรือขัดขวางบริการหรือเซิร์ฟเวอร์หรือเครือข่ายที่เชื่อมต่อกับบริการหรือการใช้งานของผู้ใช้คนอื่นและการเพลิดเพลินกับบริการ หรือฝ่าฝืนข้อกำหนด กระบวนการ นโยบาย หรือข้อบังคับของเครือข่ายที่เชื่อมต่อกับไซต์
            <br>(น) ดำเนินการหรือเข้าร่วมในการกระทำที่อาจส่งผลเสียหายทั้งทางตรงหรือทางอ้อม ปิดใช้งาน สร้างภาระหนักหรือทำให้บริการหรือเซิร์ฟเวอร์หรือเครือข่ายที่เชื่อมต่อกับบริการมีข้อบกพร่อง
            <br>(บ) ใช้บริการเพื่อเจตนาหรือไม่เจตนาฝ่าฝืนกฎหมาย กฎระเบียบ ประมวลกฎหมาย คำสั่ง แนวทางปฏิบัติ นโยบาย หรือข้อบังคับของท้องถิ่น ของรัฐ ประเทศ หรือระหว่างประเทศที่เกี่ยวข้อง รวมถึง แต่ไม่จำกัดเพียง กฎหมายและข้อกำหนด (ไม่ว่ามีอำนาจทางกฎหมายของไม่) เกี่ยวกับการป้องกันการฟอกเงินหรือการต่อต้านการก่อการร้าย
            <br>(ป) ใช้บริการเพื่อฝ่าฝืนหรือหลบเลี่ยง การคว่ำบาตรหรือการห้ามค้าขายที่ดำเนินการหรือบังคับใช้โดยสำนักควบคุมสินทรัพย์ต่างประเทศของกระทรวงการคลังสหรัฐฯคณะมนตรีความมั่นคงแห่งสหประชาชาติ กระทรวงการคลังสหภาพยุโรปหรือสหราชอาณาจักร
            <br>(ผ)ใช้บริการเพื่อฝ่าฝืนความเป็นส่วนตัวของผู้อื่นหรือ“ติดตาม”หรือก่อกวนผู้อื่น
            <br>(ฝ) ละเมิดสิทธิต่างๆ ของ Modii Shop ซึ่งรวมถึงสิทธิในทรัพย์สินทางปัญญาและการลวงขายในเรื่องนั้นๆ ด้วย
            <br>(พ)ใช้บริการเพื่อเก็บรวบรวมหรือจัดเก็บข้อมูลส่วนบุคคลเกี่ยวกับผู้ใช้คนอื่นที่เกี่ยวกับการกระทำและกิจกรรมต้องห้ามที่ระบุไว้ด้านบน 
            <br>(ฟ) ลงรายการที่ละเมิดลิขสิทธิ์ เครื่องหมายการค้า หรือสิทธิในทรัพย์สินทางปัญหาของบุคคลภายนอกหรือ ใช้บริการในลักษณะที่จะละเมิดสิทธิ์ในทรัพย์สินทางปัญญาของผู้อื่น และ/หรือสั่งหรือสนับสนุนให้ผู้ใช้ทำธุรกรรมนอกไซต์
                        
            <br>6.3 คุณเข้าใจว่าเนื้อหาทั้งหมด ไม่ว่าโพสต์ต่อสาธารณะหรือส่งต่อแบบเป็นส่วนตัว เป็นความรับผิดชอบของผู้ที่เป็นต้นกำเนิดของเนื้อหาดังกล่าวแต่เพียงผู้เดียว นั่นหมายความว่า คุณ หรือ ร้านค้า (ไม่ใช่ Modii Shop) ที่ต้องรับผิดชอบต่อเนื้อหาทั้งหมดที่คุณอัปโหลด โพสต์ อีเมล ส่งต่อ หรือทำให้ใช้งานได้ทางไซต์แต่เพียงผู้เดียว Modii Shop ไม่ควบคุมเนื้อหาที่โพสต์บนไซต์ และดังนั้น จึงไม่รับประกันความถูกต้อง ความสมบูรณ์ หรือคุณภาพของเนื้อหาดังกล่าว คุณ หรือ ร้านค้า ต้องเข้าใจว่าในการใช้ไซต์ คุณ หรือ ร้านค้า อาจพบเจอกับเนื้อหาที่อาจถือได้ว่าสร้างความขุ่นเคืองใจ ลามกอนาจารหรือน่ารังเกียจ จนถึงขอบเขตสูงสุดที่กฎหมายที่เกี่ยวข้องอนุญาตไว้ ไม่ว่าในกรณีใดก็ตาม Modii Shop จะไม่รับผิดไม่ว่าในทางใดต่อเนื้อหา รวมถึงแต่ไม่จำกัดเพียง ข้อผิดพลาด หรือการละเว้นเนื้อหา หรือการสูญเสียหรือความเสียหายชนิดใดก็ตามที่เกิดขึ้นอันเป็นผลมาจากการใช้ หรือการพึ่งพาเนื้อหาที่โพสต์ อีเมล ส่งต่อ หรือทำให้ใช้งานได้บนไซต์
            <br>6.4 คุณ หรือ ร้านค้า รับทราบ ยินยอม และตกลงว่า Modii Shop อาจเข้าถึง รักษา และเปิดเผยข้อมูลบัญชีของคุณ หรือ ร้านค้า และเนื้อหาต่อหน่วยงานทางกฎหมายหรือผู้มีอำนาจภายในรัฐ เจ้าของสิทธิที่เกี่ยวข้องหรือบุคคลที่สามอื่นๆ หากกฎหมายกำหนดไว้เช่นนั้น หรือตามคำสั่งศาลหรือโดยหน่วยงานรัฐหรือหน่วยงานทางกฎหมายที่มีเขตอำนาจเหนือ Modii Shop หรือโดยการเชื่อโดยสุจริตว่าการเข้าถึงเพื่อรักษาหรือเปิดเผยนั้นมีความจำเป็นตามสมควรเพื่อ: (ก) ปฏิบัติตามขั้นตอนทางกฎหมาย (ข) บังคับใช้เงื่อนไขการให้บริการนี้หรือ นโยบายสิ่งของต้องห้ามและสิ่งของที่ถูกจำกัดของ Modii Shop รวมทั้งข้อกำหนด เงื่อนไข และนโยบายใดๆ ของ Modii Shop (ค) ตอบสนองต่อข้อเรียกร้องที่ว่าเนื้อหาใดละเมิดสิทธิของบุคคลภายนอกรวมถึงสิทธิในทรัพย์สินทางปัญญา (ง) ตอบสนองต่อคำขอการบริการลูกค้าของคุณ หรือ (จ) ปกป้องสิทธิ ทรัพย์สินหรือความปลอดภัยส่วนบุคคลของ Modii Shop ผู้ใช้และ/หรือประชาชนทั่วไป
            <br><u>7.การละเมิดเงื่อนไขการให้บริการของเรา</u>
            <br>7.1 การละเมิดเงื่อนไขการให้บริการนี้ รวมถึงข้อกำหนด เงื่อนไข และนโยบายใดๆ ของ Modii Shop อาจส่งผลให้มีการดำเนินการหลายประการรวมถึงแต่ไม่จำกัดเพียงสิ่งใดสิ่งหนึ่งหรือทั้งหมดต่อไปนี้
            <br>oบัญชีรายชื่อถูกลบ
            <br>oถูกกำหนดขีดจำกัดสำหรับสิทธิพิเศษของบัญชี
            <br>oบัญชีถูกระงับและยกเลิกในเวลาต่อมา
            <br>oถูกดำเนินคดีอาญา
            <br>oถูกดำเนินคดีทางแพ่ง รวมถึงแต่ไม่จำกัดเพียงการเรียกร้องค่าเสียหายและ/หรือวิธีการชั่วคราว ก่อนพิพากษาหรือคำสั่งห้ามของศาล
            <br><u>8.การรายงานการละเมิดสิทธิ์ในทรัพย์สินทางปัญญา</u>
            <br>8.1 ตามที่ระบุไว้ข้างต้น Modii Shop ไม่อนุญาตให้มีการลงสินค้าที่ละเมิดสิทธิในทรัพย์สินทางปัญญาของแบรนด์หรือเจ้าของสิทธิในทรัพย์สินทางปัญญาอื่นๆ (“เจ้าของIPR”)
            <br>8.2 นอกจากกรณีที่มีการละเมิดสิทธิสิทธิในทรัพย์สินทางปัญญาตามที่ระบุข้างต้น Modii Shop ไม่มีหน้าที่ในการให้ความช่วยเหลือหรือดำเนินการใดๆ ในการบังคับใช้ข้อตกลงทางการค้าระหว่างผู้ผลิตและผู้ขาย รวมถึงเรื่องสิทธิในการจัดจำหน่ายแต่เพียงผู้เดียว และเรื่องการควบคุมราคา 
            </p>
        </div>
        <div class="modal-footer">
          <button type="button" class="btn btn-secondary" data-dismiss="modal">Close</button>
        </div>
      </div>
    </div>
</div>


@endsection

@section('custom_script')
<script>
    bottom_now(7);

    var a = "{{Session::get('msg')}}";
    if(a){
        Swal.fire({
            text : a,
            confirmButtonColor: "#fc684b",
        })
    }

    imgInp.onchange = evt => {
        const [file] = imgInp.files
        if (file) {
            blah.src = URL.createObjectURL(file)
        }
    }



    function getAmphure(v){
        $.ajax({
            url: '{{ url("getAmphure")}}',
            type: 'GET',
            dataType: 'HTML',
            data: {'v':v},
            success: function(data) {
               
                $('#county').html(data);
               
            }
        });

    }

    function getSubDistrict(v){
        $.ajax({
            url: '{{ url("getSubDistrict")}}',
            type: 'GET',
            dataType: 'HTML',
            data: {'v':v},
            success: function(data) {
               
                $('#tumbon').html(data);
               
            }
        });

    }


    function getZipcode(v){
        $.ajax({
            url: '{{ url("getZipcode")}}',
            type: 'GET',
            dataType: 'HTML',
            data: {'v':v},
            success: function(data) {
                document.getElementById('zip_code').value = data;
                // $('#zip_code').value(data);data
               
            }
        });

    }

    function autoTab(obj){
            /* กำหนดรูปแบบข้อความโดยให้ _ แทนค่าอะไรก็ได้ แล้วตามด้วยเครื่องหมาย
            หรือสัญลักษณ์ที่ใช้แบ่ง เช่นกำหนดเป็น  รูปแบบเลขที่บัตรประชาชน
            4-2215-54125-6-12 ก็สามารถกำหนดเป็น  _-____-_____-_-__
            รูปแบบเบอร์โทรศัพท์ 08-4521-6521 กำหนดเป็น __-____-____
            หรือกำหนดเวลาเช่น 12:45:30 กำหนดเป็น __:__:__
            ตัวอย่างข้างล่างเป็นการกำหนดรูปแบบเลขบัตรประชาชน
            */
                var pattern=new String("___-___-____"); // กำหนดรูปแบบในนี้
                var pattern_ex=new String("-"); // กำหนดสัญลักษณ์หรือเครื่องหมายที่ใช้แบ่งในนี้
                var returnText=new String("");
                var obj_l=obj.value.length;
                var obj_l2=obj_l-1;
                for(i=0;i<pattern.length;i++){           
                    if(obj_l2==i && pattern.charAt(i+1)==pattern_ex){
                        returnText+=obj.value+pattern_ex;
                        obj.value=returnText;
                    }
                }
                if(obj_l>=pattern.length){
                    obj.value=obj.value.substr(0,pattern.length);           
                }
    }


</script>
@endsection